{
  "banks": "The Banks subsector on the Indonesia Stock Exchange is a crucial component of the country's market. It encompasses various subindustries, with the primary focus on banking. This subsector plays a major role in Indonesia's market due to the country's history and potential. Indonesia has a large population and a growing middle class, which creates a significant demand for banking services. Additionally, the government has implemented policies to promote financial inclusion and encourage banking sector growth. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 3% over the past 365 days. It appears that 24 companies in this sub-sector might have seen a positive market cap change, while around 23 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#BBCA.JK]PT Bank Central Asia Tbk[\\#BBCA.JK], [#BBRI.JK]PT Bank Rakyat Indonesia (Persero) Tbk[\\#BBRI.JK], [#BMRI.JK]PT Bank Mandiri (Persero) Tbk[\\#BMRI.JK], [#BBNI.JK]PT Bank Negara Indonesia (Persero) Tbk[\\#BBNI.JK], and [#BRIS.JK]PT Bank Syariah Indonesia Tbk[\\#BRIS.JK].",
  "insurance": "The Insurance subsector on the Indonesia Stock Exchange is a significant sector that comprises various subindustries, including Life Insurance, General Insurance, and Reinsurance. This subsector plays a major role in the Indonesian market due to several factors. Firstly, insurance penetration in Indonesia is relatively low compared to other countries, indicating significant growth potential. Additionally, the country's large population and increasing middle class provide a vast customer base for insurance products. Furthermore, the government's focus on infrastructure development and economic growth creates opportunities for insurance companies to provide coverage for these projects. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -11% over the past 365 days. It's possible that around 10 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 8 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#LIFE.JK]PT MSIG Life Insurance Indonesia Tbk[\\#LIFE.JK], [#PNLF.JK]Panin Financial Tbk[\\#PNLF.JK], [#TUGU.JK]PT Asuransi Tugu Pratama Indonesia Tbk[\\#TUGU.JK], [#PNIN.JK]Paninvest Tbk[\\#PNIN.JK], and [#ABDA.JK]Asuransi Bina Dana Arta Tbk[\\#ABDA.JK].",
  "tobacco": "The Tobacco subsector on the Indonesia Stock Exchange consists of various subindustries, with the main focus being on tobacco-related products. This subsector plays a major role in Indonesia's market due to the country's long history and culture of tobacco consumption. Tobacco has been a significant part of Indonesia's economy for decades, and the demand for tobacco products remains high. Additionally, Indonesia has a large population, providing a vast consumer base for these companies. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -27% over the past 365 days. It's possible that around 3 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 1 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#RMBA.JK]Bentoel International Investama Tbk[\\#RMBA.JK], [#HMSP.JK]HM Sampoerna Tbk[\\#HMSP.JK], [#GGRM.JK]Gudang Garam Tbk[\\#GGRM.JK], [#WIIM.JK]Wismilak Inti Makmur Tbk[\\#WIIM.JK], and [#ITIC.JK]PT Indonesian Tobacco Tbk[\\#ITIC.JK].",
  "oil-gas-coal": "The Oil, Gas & Coal subsector on the Indonesia Stock Exchange encompasses various industries related to the production, distribution, and services of oil, gas, and coal Indonesia is one of the world's largest producers and exporters of coal, and also has significant oil and gas reserves. The demand for these resources, both domestically and internationally, has contributed to the growth and potential of this subsector. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 35% over the past 365 days. It appears that 43 companies in this sub-sector might have seen a positive market cap change, while around 34 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#BYAN.JK]Bayan Resources Tbk[\\#BYAN.JK], [#DSSA.JK]Dian Swastatika Sentosa Tbk[\\#DSSA.JK], [#ADRO.JK]Adaro Energy Indonesia Tbk[\\#ADRO.JK], [#CUAN.JK]PT Petrindo Jaya Kreasi Tbk[\\#CUAN.JK], and [#ADMR.JK]PT Adaro Minerals Indonesia Tbk[\\#ADMR.JK].",
  "technology-hardware-equipment": "The Technology Hardware & Equipment subsector on the Indonesia Stock Exchange encompasses various subindustries such as Computer Hardware, Electronic Equipment & Instruments, and Networking Equipment. This subsector plays a major role in Indonesia's market due to the country's increasing focus on digitalization and technological advancements. With a growing population and a rising middle class, there is a significant demand for technology products and services in Indonesia. Additionally, the government's initiatives to improve infrastructure and promote digital transformation further contribute to the potential growth of this subsector. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 47% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (6) in market capitalization compared to those with positive changes (3). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#MTDL.JK]Metrodata Electronics Tbk[\\#MTDL.JK], [#MSTI.JK]PT Mastersystem Infotama Tbk[\\#MSTI.JK], [#CHIP.JK]PT Pelita Teknologi Global Tbk[\\#CHIP.JK], [#PTSN.JK]Sat Nusapersada Tbk[\\#PTSN.JK], and [#AXIO.JK]PT Tera Data Indonusa Tbk[\\#AXIO.JK].",
  "transportation": "The Transportation subsector on the Indonesia Stock Exchange plays a major role in the country's market due to Indonesia's vast archipelago and growing economy. The subsector comprises various subindustries, including road transportation and airlines. This subsector is essential for the country's economic growth as it facilitates the movement of goods and people across the nation. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -41% over the past 365 days. It's possible that around 10 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 2 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#BIRD.JK]PT Blue Bird Tbk[\\#BIRD.JK], [#ASSA.JK]Adi Sarana Armada Tbk[\\#ASSA.JK], [#IMJS.JK]PT Indomobil Multi Jasa Tbk[\\#IMJS.JK], [#GIAA.JK]Garuda Indonesia (Persero) Tbk[\\#GIAA.JK], and [#CMPP.JK]PT AirAsia Indonesia Tbk[\\#CMPP.JK].",
  "pharmaceuticals-health-care-research": "The Pharmaceuticals & Health Care Research subsector on the Indonesia Stock Exchange encompasses companies involved in the pharmaceuticals industry. This subsector plays a major role in Indonesia's market due to several factors. Firstly, the country's growing population and increasing healthcare needs create a significant demand for pharmaceutical products. Additionally, the government's focus on improving healthcare infrastructure and expanding access to healthcare services further drives the growth of this subsector. Moreover, Indonesia's potential as a hub for pharmaceutical research and development attracts both domestic and international companies, leading to increased investments and advancements in the industry. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -20% over the past 365 days. It's possible that around 7 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 4 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#KLBF.JK]Kalbe Farma Tbk[\\#KLBF.JK], [#SIDO.JK]PT Industri Jamu Dan Farmasi Sido Muncul Tbk[\\#SIDO.JK], [#TSPC.JK]Tempo Scan Pacific Tbk[\\#TSPC.JK], [#SOHO.JK]PT Soho Global Health Tbk[\\#SOHO.JK], and [#KAEF.JK]Kimia Farma Tbk[\\#KAEF.JK].",
  "consumer-services": "The Consumer Services subsector on the Indonesia Stock Exchange encompasses a range of industries such as recreational and sports facilities, hotels, resorts, cruise lines, restaurants, travel agencies, and education services. This subsector plays a major role in Indonesia's market due to the country's growing middle class and increasing disposable income. As more Indonesians have the means to spend on leisure activities, travel, and education, the demand for consumer services has been steadily rising. Moreover, Indonesia's tourism industry has been experiencing significant growth, with the government actively promoting the country as a tourist destination. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 22% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (36) in market capitalization compared to those with positive changes (12). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#CNMA.JK]PT Nusantara Sejahtera Raya Tbk[\\#CNMA.JK], [#KPIG.JK]MNC Land Tbk[\\#KPIG.JK], [#MAPB.JK]PT MAP Boga Adiperkasa Tbk[\\#MAPB.JK], [#JSPT.JK]Jakarta Setiabudi Internasional Tbk[\\#JSPT.JK], and [#FAST.JK]PT Fast Food Indonesia Tbk[\\#FAST.JK].",
  "food-staples-retailing": "The Food & Staples Retailing subsector on the Indonesia Stock Exchange encompasses various industries such as supermarkets, convenience stores, food retail and distributors, and drug retail and distributors. This subsector plays a major role in Indonesia's market due to the country's large population and rising middle class, which has led to increased consumer spending on food and staples. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 4% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (8) in market capitalization compared to those with positive changes (6). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#AMRT.JK]PT Sumber Alfaria Trijaya Tbk[\\#AMRT.JK], [#MIDI.JK]Midi Utama Indonesia Tbk[\\#MIDI.JK], [#DMND.JK]PT Diamond Food Indonesia Tbk[\\#DMND.JK], [#EPMT.JK]Enseval Putera Megatrading Tbk[\\#EPMT.JK], and [#HERO.JK]Hero Supermarket Tbk[\\#HERO.JK].",
  "transportation-infrastructure": "The Transportation Infrastructure subsector on the Indonesia Stock Exchange is a crucial component of the country's economy. It encompasses industries such as Highways & Railtracks, Marine Ports & Services, and Airport Operators. This subsector plays a major role in Indonesia's market due to the country's large population and growing economy. As the government focuses on infrastructure development to improve connectivity and support economic growth, the demand for transportation infrastructure services is expected to increase. This presents significant potential for companies in this subsector to benefit from government projects and investments, making it an attractive area for investors. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 35% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (5) in market capitalization compared to those with positive changes (4). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#JSMR.JK]PT Jasa Marga Tbk[\\#JSMR.JK], [#CMNP.JK]Citra Marga Nusaphala Persada Tbk[\\#CMNP.JK], [#META.JK]Nusantara Infrastructure Tbk[\\#META.JK], [#CASS.JK]Cardig Aero Services Tbk[\\#CASS.JK], and [#PORT.JK]PT Nusantara Pelabuhan Handal Tbk[\\#PORT.JK].",
  "media-entertainment": "The Media & Entertainment subsector on the Indonesia Stock Exchange plays a major role in the country's market due to various factors. Indonesia has a large and growing population, with a significant portion of the population being young and tech-savvy. This demographic is increasingly consuming media and entertainment content, creating a high demand for companies in this subsector. Additionally, the Indonesian government has been supportive of the media and entertainment industry, implementing policies to encourage growth and investment. With the rise of digital platforms and increasing internet penetration, there is a significant potential for companies in this subsector to expand and capitalize on the growing market. Furthermore, Indonesia has a rich cultural heritage and a diverse entertainment industry, which provides opportunities for companies involved in entertainment and movie production, broadcasting, advertising, cable, and satellite services, as well as consumer publishing. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -5% over the past 365 days. It's possible that around 15 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 3 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#FILM.JK]PT MD Pictures Tbk[\\#FILM.JK], [#MSIN.JK]PT MNC Digital Entertainment Tbk[\\#MSIN.JK], [#SCMA.JK]Surya Citra Media Tbk[\\#SCMA.JK], [#MNCN.JK]Media Nusantara Citra Tbk[\\#MNCN.JK], and [#BMTR.JK]PT Global Mediacom Tbk[\\#BMTR.JK].",
  "nondurable-household-products": "The Nondurable Household Products subsector on the Indonesia Stock Exchange consists of various subindustries, with one notable subindustry being Personal Care Products This subsector plays a major role in the Indonesian market due to the country's large population and increasing disposable income. As consumers become more conscious about personal hygiene and grooming, the demand for personal care products is expected to grow. Additionally, the trend of natural and organic products is gaining popularity, presenting opportunities for companies in this subsector to capitalize on this growing market segment. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -40% over the past 365 days. It's possible that around 10 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 1 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#UNVR.JK]Unilever Indonesia Tbk[\\#UNVR.JK], [#VICI.JK]PT Victoria Care Indonesia Tbk[\\#VICI.JK], [#UCID.JK]PT Uni-Charm Indonesia Tbk[\\#UCID.JK], [#KINO.JK]PT Kino Indonesia Tbk[\\#KINO.JK], and [#MSJA.JK]PT Multi Spunindo Jaya Tbk[\\#MSJA.JK].",
  "utilities": "The Utilities subsector on the Indonesia Stock Exchange encompasses industries such as Electric Utilities and Gas Utilities. This subsector plays a major role in Indonesia's market due to the country's growing energy needs and potential for renewable energy sources. With a large population and increasing urbanization, the demand for electricity and gas is expected to rise significantly in the coming years. The government has been focusing on promoting renewable energy and improving the country's infrastructure, which presents opportunities for companies in this subsector. Additionally, the Utilities subsector has historically been seen as a stable and reliable investment option, attracting investors seeking steady returns. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 2472% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (5) in market capitalization compared to those with positive changes (3). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#BREN.JK]PT Barito Renewables Energy Tbk[\\#BREN.JK], [#PGEO.JK]PT Pertamina Geothermal Energy Tbk[\\#PGEO.JK], [#POWR.JK]PT Cikarang Listrindo Tbk[\\#POWR.JK], [#ARKO.JK]PT Arkora Hydro Tbk[\\#ARKO.JK], and [#KEEN.JK]PT Kencana Energi Lestari Tbk[\\#KEEN.JK].",
  "holding-investment-companies": "The Holding & Investment Companies subsector on the Indonesia Stock Exchange is an important component of the country's market. This subsector consists of various subindustries, such as Financial Holdings and Investment Companies. This subsector plays a major role in Indonesia's market due to its historical significance and potential for growth. Holding and Investment Companies are crucial for the development of various sectors within the economy, such as banking, infrastructure, and real estate. They provide capital, expertise, and strategic guidance to these sectors, contributing to their growth and overall economic development. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 4% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (11) in market capitalization compared to those with positive changes (8). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#SMMA.JK]PT Sinar Mas Multiartha Tbk[\\#SMMA.JK], [#DNET.JK]PT Indoritel Makmur Internasional Tbk[\\#DNET.JK], [#CASA.JK]PT Capital Financial Indonesia Tbk[\\#CASA.JK], [#SRTG.JK]PT Saratoga Investama Sedaya Tbk[\\#SRTG.JK], and [#APIC.JK]PACIFIC STRATEGIC FINANCIAL Tbk[\\#APIC.JK].",
  "telecommunication": "The Telecommunication subsector on the Indonesia Stock Exchange is a significant player in the country's market due to its historical importance and potential for growth. The subsector comprises various subindustries, including Integrated Telecommunication Service, Wireless Telecommunication Services, and Wired Telecommunication Service. This subsector plays a major role in Indonesia's market as it provides essential communication services to a vast population, contributing to economic development and connectivity. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -13% over the past 365 days. It's possible that around 15 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 6 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#TLKM.JK]PT Telkom Indonesia (Persero) Tbk[\\#TLKM.JK], [#ISAT.JK]PT Indosat Tbk[\\#ISAT.JK], [#MTEL.JK]PT Dayamitra Telekomunikasi Tbk[\\#MTEL.JK], [#SUPR.JK]Solusi Tunas Pratama Tbk[\\#SUPR.JK], and [#TBIG.JK]PT Tower Bersama Infrastructure Tbk[\\#TBIG.JK].",
  "logistics-deliveries": "The Logistics & Deliveries subsector on the Indonesia Stock Exchange is an important segment of the country's market. It encompasses various industries involved in logistics and delivery services. This subsector plays a major role in Indonesia's market due to the country's geographical nature, with its vast archipelago and diverse landscapes. The need for efficient logistics and delivery services is crucial for businesses to operate effectively and serve customers across the country. Additionally, with the growth of e-commerce and the increasing demand for online shopping, the logistics and deliveries subsector has experienced significant growth potential. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -32% over the past 365 days. It's possible that around 17 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 6 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#TMAS.JK]PT Temas Tbk[\\#TMAS.JK], [#SMDR.JK]Samudera Indonesia Tbk[\\#SMDR.JK], [#ELPI.JK]PT Pelayaran Nasional Ekalya Purnamasari Tbk[\\#ELPI.JK], [#HATM.JK]PT Habco Trans Maritima Tbk[\\#HATM.JK], and [#NELY.JK]Pelayaran Nelly Dwi Putri Tbk[\\#NELY.JK].",
  "industrial-services": "The Industrial Services subsector on the Indonesia Stock Exchange encompasses a range of industries such as diversified industrial trading, commercial printing, business support services, research and consulting services, office supplies, and human resource and employment services. This subsector plays a major role in Indonesia's market due to the country's growing economy and increasing demand for industrial services. As Indonesia continues to develop and modernize, businesses require support services, consulting, and office supplies, creating significant opportunities for companies in this subsector. Additionally, the rise of e-commerce and digitalization has further boosted the demand for services related to human resources and employment. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 28% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (9) in market capitalization compared to those with positive changes (6). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#JTPE.JK]Jasuindo Tiga Perkasa Tbk[\\#JTPE.JK], [#MHKI.JK]PT Multi Hanna Kreasindo Tbk[\\#MHKI.JK], [#ASGR.JK]Astra Graphia Tbk[\\#ASGR.JK], [#VISI.JK]PT Satu Visi Putra Tbk[\\#VISI.JK], and [#KING.JK]PT Hoffmen Cleanindo Tbk[\\#KING.JK].",
  "leisure-goods": "The Leisure Goods subsector on the Indonesia Stock Exchange encompasses various industries, including Sport Equipment & Hobbies Goods. This subsector plays a major role in Indonesia's market due to the country's growing middle class and increasing disposable income. As Indonesians have more money to spend on leisure activities and hobbies, the demand for leisure goods is expected to rise. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 59% over the past 365 days. It appears that 2 companies in this sub-sector might have seen a positive market cap change, while around 1 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#IIKP.JK]Inti Agri Resources Tbk[\\#IIKP.JK], [#UNTD.JK]PT Terang Dunia Internusa Tbk[\\#UNTD.JK], [#BIKE.JK]PT Sepeda Bersama Indonesia Tbk[\\#BIKE.JK], and [#TOYS.JK]PT Sunindo Adipersada Tbk[\\#TOYS.JK].",
  "multi-sector-holdings": "The Multi-sector Holdings subsector on the Indonesia Stock Exchange is a diverse sector that encompasses various industries. This subsector plays a major role in Indonesia's market due to its ability to diversify investments across different industries. It allows investors to gain exposure to multiple sectors, reducing risk and increasing potential returns. Additionally, this subsector reflects the country's economic growth and potential as it encompasses a wide range of industries that contribute to Indonesia's development. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -18% over the past 365 days. It's possible that around 3 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 1 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#ASII.JK]Astra International Tbk[\\#ASII.JK], [#BNBR.JK]Bakrie & Brothers Tbk[\\#BNBR.JK], [#BHIT.JK]PT MNC Asia Holding Tbk[\\#BHIT.JK], [#FOLK.JK]PT Multi Garam Utama Tbk[\\#FOLK.JK], and [#ZBRA.JK]PT Dosni Roha Indonesia Tbk[\\#ZBRA.JK].",
  "retailing": "The Retailing subsector on the Indonesia Stock Exchange encompasses a range of industries, such as electronics retail, apparel and textile retail, home improvement retail, automotive retail, department stores, and consumer distributors. This subsector plays a major role in Indonesia's market due to the country's history and potential. Indonesia has a large consumer base, with a growing middle class and increasing disposable income. Moreover, the country's strong economic growth and urbanization have led to a rise in consumer spending. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -8% over the past 365 days. It's possible that around 20 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 8 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#TURI.JK]Tunas Ridean Tbk[\\#TURI.JK], [#MAPI.JK]Mitra Adiperkasa Tbk[\\#MAPI.JK], [#MAPA.JK]PT MAP Aktif Adiperkasa Tbk[\\#MAPA.JK], [#ACES.JK]Ace Hardware Indonesia Tbk[\\#ACES.JK], and [#TRIO.JK]Trikomsel Oke Tbk[\\#TRIO.JK].",
  "basic-materials": "The Basic Materials subsector on the Indonesia Stock Exchange encompasses a range of industries such as copper, basic chemicals, diversified metals & minerals, gold, paper, construction materials, specialty chemicals, containers & packaging, aluminum, iron & steel, agricultural chemicals, diversified forest, and timber. This subsector plays a major role in Indonesia's market due to the country's rich natural resources and the demand for these materials in various sectors such as infrastructure, manufacturing, and agriculture. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 125% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (66) in market capitalization compared to those with positive changes (35). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#TPIA.JK]PT Chandra Asri Petrochemical Tbk[\\#TPIA.JK], [#AMMN.JK]PT Amman Mineral Internasional Tbk[\\#AMMN.JK], [#BRPT.JK]Barito Pacific Tbk[\\#BRPT.JK], [#MDKA.JK]PT Merdeka Copper Gold Tbk[\\#MDKA.JK], and [#MBMA.JK]PT Merdeka Battery Materials Tbk[\\#MBMA.JK].",
  "healthcare-equipment-providers": "The Healthcare Equipment & Providers subsector on the Indonesia Stock Exchange consists of various subindustries, such as healthcare providers and healthcare supplies & distributions. This subsector is significant in Indonesia's market due to the country's growing population and increasing demand for healthcare services. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 11% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (11) in market capitalization compared to those with positive changes (7). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#MIKA.JK]PT Mitra Keluarga Karyasehat Tbk[\\#MIKA.JK], [#SILO.JK]PT Siloam International Hospitals Tbk[\\#SILO.JK], [#SRAJ.JK]Sejahteraraya Anugrahjaya Tbk[\\#SRAJ.JK], [#HEAL.JK]PT Medikaloka Hermina Tbk[\\#HEAL.JK], and [#PRAY.JK]PT Famon Awal Bros Sedaya Tbk[\\#PRAY.JK].",
  "alternative-energy": "The Alternative Energy subsector on the Indonesia Stock Exchange consists of various industries, including Alternative Energy Equipment. This subsector plays a major role in Indonesia's market due to the country's commitment to reducing its reliance on fossil fuels and promoting renewable energy sources. With its abundant natural resources and growing energy demand, Indonesia has significant potential for alternative energy development. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 25% over the past 365 days. It appears that 1 companies in this sub-sector might have seen a positive market cap change, while around 1 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#SEMA.JK]PT Semacom Integrated Tbk[\\#SEMA.JK] and [#JSKY.JK]PT Sky Energy Indonesia Tbk[\\#JSKY.JK].",
  "heavy-constructions-civil-engineering": "The Heavy Constructions & Civil Engineering subsector on the Indonesia Stock Exchange is a significant player in the country's market due to its crucial role in infrastructure development. With Indonesia's growing population and urbanization, there is a constant demand for new roads, bridges, buildings, and other construction projects. Additionally, the Indonesian government has been actively promoting infrastructure development, which further boosts the potential for growth in this subsector. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 7% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (22) in market capitalization compared to those with positive changes (4). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#WSKT.JK]PT Waskita Karya (Persero) Tbk[\\#WSKT.JK], [#WIKA.JK]PT Wijaya Karya (Persero) Tbk[\\#WIKA.JK], [#SSIA.JK]PT Surya Semesta Internusa Tbk[\\#SSIA.JK], [#BUKK.JK]Bukaka Teknik Utama Tbk[\\#BUKK.JK], and [#BDKR.JK]PT Berdikari Pondasi Perkasa Tbk[\\#BDKR.JK].",
  "investment-service": "The Investment Service subsector on the Indonesia Stock Exchange plays a major role in the country's market due to its significance in facilitating investment activities and managing assets. With subindustries like Investment Banking & Brokerage Services and Investment Management, this subsector is responsible for providing financial services to investors, including advising on investment opportunities, executing trades, and managing portfolios. Indonesia's market has seen significant growth in recent years, attracting both domestic and international investors. The potential for further growth in the subsector is high, as the country's economy continues to develop and the demand for investment services increases. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -5% over the past 365 days. It's possible that around 5 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 1 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#YULE.JK]Yulie Sekuritas Indonesia Tbk[\\#YULE.JK], [#AMOR.JK]PT Ashmore Asset Management Indonesia Tbk[\\#AMOR.JK], [#TRIM.JK]PT Trimegah Sekuritas Indonesia Tbk[\\#TRIM.JK], [#PANS.JK]Panin Sekuritas Tbk[\\#PANS.JK], and [#RELI.JK]Reliance Sekuritas Indonesia Tbk[\\#RELI.JK].",
  "food-beverage": "The Food & Beverage subsector on the Indonesia Stock Exchange is a significant player in the country's market due to several factors. Indonesia has a large population, making it a promising market for food and beverage companies. Additionally, the country has a rich agricultural sector, providing a steady supply of raw materials for the industry. Furthermore, the potential for growth in this subsector is high, as the rising middle class in Indonesia is driving increased consumption of processed foods, soft drinks, and dairy products. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 4% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (59) in market capitalization compared to those with positive changes (29). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#ICBP.JK]Indofood CBP Sukses Makmur Tbk[\\#ICBP.JK], [#CPIN.JK]Charoen Pokphand Indonesia Tbk[\\#CPIN.JK], [#PANI.JK]PT Pantai Indah Kapuk Dua Tbk[\\#PANI.JK], [#INDF.JK]Indofood Sukses Makmur Tbk[\\#INDF.JK], and [#MYOR.JK]Mayora Indah Tbk[\\#MYOR.JK].",
  "household-goods": "The Household Goods subsector on the Indonesia Stock Exchange consists of various subindustries such as home furnishings, household appliances, and housewares & specialties. This subsector plays a major role in the Indonesian market due to several factors. Firstly, Indonesia's growing middle class and increasing disposable income have led to a rise in consumer spending on household goods. Additionally, the country's rapid urbanization and housing development have created a demand for home furnishings and appliances. Furthermore, the potential for further growth in this subsector is high, as Indonesia's population continues to expand and the housing market remains robust. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -8% over the past 365 days. It's possible that around 10 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 2 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#WOOD.JK]PT Integra Indocabinet Tbk[\\#WOOD.JK], [#LIVE.JK]PT Homeco Victoria Makmur Tbk[\\#LIVE.JK], [#GEMA.JK]Gema Grahasarana Tbk[\\#GEMA.JK], [#SCNP.JK]PT Selaras Citra Nusantara Perkasa Tbk[\\#SCNP.JK], and [#MEJA.JK]PT Harta Djaya Karya Tbk[\\#MEJA.JK].",
  "industrial-goods": "The Industrial Goods subsector on the Indonesia Stock Exchange plays a major role in the country's market due to its importance in supporting infrastructure development and industrial growth. With subindustries such as Construction Machinery & Heavy Vehicles, Building Products & Fixtures, Industrial Machinery & Components, and Electrical Components & Equipment, this subsector is crucial for the construction, manufacturing, and energy sectors. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -4% over the past 365 days. It's possible that around 28 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 11 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#UNTR.JK]United Tractors Tbk[\\#UNTR.JK], [#IMPC.JK]PT Impack Pratama Industri Tbk[\\#IMPC.JK], [#HEXA.JK]Hexindo Adiperkasa Tbk[\\#HEXA.JK], [#ARNA.JK]Arwana Citramulia Tbk[\\#ARNA.JK], and [#MARK.JK]PT Mark Dynamics Indonesia Tbk[\\#MARK.JK].",
  "financing-service": "The Financing Service subsector on the Indonesia Stock Exchange plays a major role in the country's market due to its significance in providing financial services to consumers. This subsector, which includes Consumer Financing, is essential for supporting the growth of various industries by offering loans and credit facilities to individuals and businesses. This subsector's trend is driven by Indonesia's growing middle class and increasing consumer spending, which creates a higher demand for financing services. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 9% over the past 365 days. It appears that 10 companies in this sub-sector might have seen a positive market cap change, while around 5 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#FINN.JK]PT First Indo American Leasing Tbk[\\#FINN.JK], [#BFIN.JK]BFI Finance Indonesia Tbk[\\#BFIN.JK], [#ADMF.JK]Adira Dinamika Multi Finance Tbk[\\#ADMF.JK], [#MFIN.JK]PT Mandala Multifinance Tbk[\\#MFIN.JK], and [#CFIN.JK]Clipan Finance Indonesia Tbk[\\#CFIN.JK].",
  "apparel-luxury-goods": "The Apparel & Luxury Goods subsector on the Indonesia Stock Exchange encompasses various subindustries such as textiles, clothing, accessories, bags, and footwear. This subsector plays a significant role in Indonesia's market due to the country's rich history in textile production and its potential for growth in the luxury goods market. Indonesia has a long tradition of textile manufacturing, and with its large population and rising middle class, there is a growing demand for clothing and luxury goods. Additionally, the government has implemented policies to support the growth of the textile industry, making it an attractive sector for investment. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 1% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (16) in market capitalization compared to those with positive changes (6). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#TFCO.JK]Tifico Fiber Indonesia Tbk[\\#TFCO.JK], [#ARGO.JK]Argo Pantes Tbk[\\#ARGO.JK], [#SRIL.JK]PT Sri Rejeki Isman Tbk[\\#SRIL.JK], [#INDR.JK]PT Indo-Rama Synthetics Tbk[\\#INDR.JK], and [#HRTA.JK]PT Hartadinata Abadi Tbk[\\#HRTA.JK].",
  "software-it-services": "The Software & IT Services subsector on the Indonesia Stock Exchange encompasses various subindustries such as Online Applications & Services, IT Services & Consulting, and Software. This subsector plays a major role in Indonesia's market due to several factors. Firstly, Indonesia has a large and growing population, which presents a significant market for technology-based services and software. Additionally, the country has been experiencing rapid digital transformation, with increasing internet penetration and smartphone usage. This has led to a surge in demand for online applications, IT services, and consulting. Furthermore, the government has been actively promoting the development of the digital economy, providing support and incentives for companies in the Software & IT Services subsector. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -34% over the past 365 days. It's possible that around 24 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 8 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#DCII.JK]PT DCI Indonesia Tbk[\\#DCII.JK], [#GOTO.JK]PT GoTo Gojek Tokopedia Tbk[\\#GOTO.JK], [#BELI.JK]PT Global Digital Niaga Tbk[\\#BELI.JK], [#EMTK.JK]Elang Mahkota Teknologi Tbk[\\#EMTK.JK], and [#BUKA.JK]PT Bukalapak.com Tbk[\\#BUKA.JK].",
  "automobiles-components": "The Automobiles & Components subsector on the Indonesia Stock Exchange encompasses various industries such as Auto Parts & Equipment and Tires. This subsector plays a major role in Indonesia's market due to the country's growing automotive industry. With a large population and increasing middle class, there is a rising demand for automobiles and related components. Additionally, the government has implemented policies to promote the development of the automotive sector, including tax incentives and investment opportunities. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 27% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (9) in market capitalization compared to those with positive changes (5). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#MASA.JK]Multistrada Arah Sarana Tbk[\\#MASA.JK], [#SMSM.JK]Selamat Sempurna Tbk[\\#SMSM.JK], [#AUTO.JK]Astra Otoparts Tbk[\\#AUTO.JK], [#VKTR.JK]PT VKTR Teknologi Mobilitas Tbk[\\#VKTR.JK], and [#DRMA.JK]PT Dharma Polimetal Tbk[\\#DRMA.JK].",
  "properties-real-estate": "The Properties & Real Estate subsector on the Indonesia Stock Exchange is an important sector in the country's market. It encompasses various subindustries, such as real estate development and management, as well as real estate services. This subsector plays a major role in Indonesia's market due to the country's growing population and urbanization. As more people move to urban areas, the demand for housing, commercial spaces, and real estate services increases. Additionally, the government's infrastructure development initiatives and policies to attract foreign investment also contribute to the growth and potential of this subsector. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -5% over the past 365 days. It's possible that around 64 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 23 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#MKPI.JK]Metropolitan Kentjana Tbk[\\#MKPI.JK], [#CTRA.JK]Ciputra Development Tbk[\\#CTRA.JK], [#BSDE.JK]PT Bumi Serpong Damai Tbk[\\#BSDE.JK], [#PWON.JK]Pakuwon Jati Tbk[\\#PWON.JK], and [#MPRO.JK]PT Maha Properti Indonesia Tbk[\\#MPRO.JK]."
}
