[{"id": 129, "created_at": "2024-08-12T09:35:37.559849+00:00", "title": "Menara Syariah & Inceif University Symposium 2024 to Focus on Islamic Financial Principles and Digital Innovations for Sustainable Development.", "body": "Menara Syariah Inceif University hosts the 1st symposium in August 2024 to promote the adoption of Islamic financial principles amidst global challenges. The event features discussions on modern waqf management, sustainability, and sharia investment regulation, emphasizing the transformative potential of focusing on waqf for sustainable development in the Islamic finance industry. Prof. Mohammad Nuh highlights the significance of technology partnerships for waqf 2.0 paradigm shift and aims to integrate digital solutions with ethical finance principles for achieving sustainable development goals.", "source": "https://www.idnfinancials.com/news/50557/msius-promotes-modern-waqf-practices-islamic-collaboration-investments", "timestamp": "2024-08-08T15:38:30", "sector": "financials", "sub_sector": ["banks"], "tags": ["Sharia Economy", "Fintech"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 2}, "votes": null}, {"id": 404, "created_at": "2024-09-05T03:37:53.315343+00:00", "title": "Sunaie, a former grocery store owner, becomes a successful Brilink agent and UMI partner, helping many people in her community access financial services and escape financial problems.", "body": "Sunaie, a grocery store owner, has successfully become a BRILink agent and UMI partner, serving dozens of customers with total loans reaching hundreds of millions, with an average loan of Rp 5-10 million per person to support local businesses. As a BRILink agent and UMI partner, Sunaie has improved her economy and helped people around her escape financial difficulties, with the goal of building a micro-economic ecosystem through loan distribution.", "source": "https://www.idnfinancials.com/news/50791/bringing-financial-access-closer-heres-success-story-sunaie-brilink-agent-umi-partner", "timestamp": "2024-09-02T15:43:09", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Fintech", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 2}, "votes": null}]