[{"id": 116, "created_at": "2024-08-12T09:03:25.60721+00:00", "title": "Indika Energi's Subsidiaries to Form New Land Transportation Equipment Rental Company.", "body": "PT Indika Energi Tbk is forming a new subsidiary, PT Kalista Biru Nusantara, with a total investment of IDR 6.25 billion to engage in rental lease-purchase activities for non-motorized land transportation equipment. This move aligns with Indika's business expansion into the electric vehicle sector, as the company reported total assets of USD 3.13 billion, cash and cash equivalents of USD 783.49 million, and total equity of USD 1.36 billion as of June 30, 2024 according to IDNFinancials data.", "source": "https://www.idnfinancials.com/news/50576/indika-energis-subsidiary-establish-subsidiary-investing-idr", "timestamp": "2024-08-12T11:02:03", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "IDX", "Market Trends"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 161, "created_at": "2024-08-12T09:37:46.253676+00:00", "title": "Indonesia's Economic Growth Shows Positive Trends in the First Half of 2024.", "body": "Statistics Indonesia reported a 5.08% year-on-year economic growth in the first half of 2024 with notable growth in government administration, healthcare, food & beverage, and manufacturing sectors. The second quarter of 2024 saw a 3.79% increase from the first quarter, with strong growth in agriculture and government consumption expenditure.", "source": "https://www.idnfinancials.com/news/50525/bps-economic-growth-reached-h", "timestamp": "2024-08-06T13:52:42", "sector": "", "sub_sector": ["government-administration"], "tags": ["Economic Reports", "Market Trends", "Market Sentiment", "IDX", "Market Analysis"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 287, "created_at": "2024-08-21T03:27:44.289391+00:00", "title": "Indonesia's trade surplus narrows to $0.47 billion in July 2024 due to rising oil and gas imports.", "body": "Indonesia's trade surplus in July 2024 was USD 0.47 billion, a significant decrease from June 2024's USD 2.39 billion, but still supported by a non-oil gas trade surplus of USD 2.61 billion. The surplus was driven by exports of natural resources, metal ores, and manufacturing products to countries like China, the United States, and India, despite a USD 2.13 billion deficit in the oil and gas sector.", "source": "https://www.idnfinancials.com/news/50623/trade-surplus-hit-july", "timestamp": "2024-08-16T19:07:14", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Economic Reports", "Energy Commodities", "Metals and Minerals", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 294, "created_at": "2024-08-22T03:28:33.280189+00:00", "title": "Financial Services Authority Urges Jiwasraya to Resolve Policyholders' Disputes Through Legal Process", "body": "The Financial Services Authority (OJK) urges PT Asuransi Jiwasraya to resolve policyholders' disputes in a comprehensive manner, as most policyholders have agreed to the restructuring scheme and been transferred to PT Asuransi Jiwa IFG, which will provide healthier products and secure policyholders' rights. Jiwasraya has been ordered to present a financial health plan approved by its shareholders and related ministries, with OJK respecting ongoing legal proceedings regarding policyholders' disagreements.", "source": "https://www.idnfinancials.com/news/50650/ojk-urges-jiwasraya-address-policyholders-refusing-restructure", "timestamp": "2024-08-20T15:30:50", "sector": "financials", "sub_sector": ["insurance"], "tags": ["Financial Ratios", "Market Sentiment", "IDX", "Executive Changes", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 192, "created_at": "2024-08-12T09:40:39.292212+00:00", "title": "Adira Dinamika Multifinance Reports 10.68% Revenue Increase in H1 2024, Despite Profit Decline Due to Rise in Total Expenses.", "body": "PT Adira Dinamika Multifinance Tbk reported a 10.68% increase in revenue in H1 2024, reaching IDR 5 trillion, with profit declining by 6.58% due to a rise in total expenses by 16.32% year-on-year. The main contributor to revenue was consumer financing, which generated IDR 3.14 trillion, and various other financial metrics also saw improvements or increases.", "source": "https://www.idnfinancials.com/news/50493/adira-finance-profit-shrinkage-swelling-expenses", "timestamp": "2024-08-02T14:27:56", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Earnings Report", "Financial Ratios", "IDX", "Market Trends"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 183, "created_at": "2024-08-12T09:39:59.921703+00:00", "title": "Indonesia's Banking Industry Urged to Enhance Agility to Navigate Economic Challenges and Seize Opportunities in a Rapidly Changing Global Environment.", "body": "Indonesia's banking industry faces evolving global economic challenges and opportunities, with a projected world GDP growth of 3.2% in 2024. Amidst changing dynamics, the industry is encouraged to innovate, manage liquidity challenges, increase green financing, and embrace digital transformation for sustainable development and competitive advantage.", "source": "https://www.idnfinancials.com/news/50502/hery-gunardi-banking-agility-future-economic-challenges-opportunities", "timestamp": "2024-08-03T20:29:56", "sector": "financials", "sub_sector": ["banks"], "tags": ["Market Trends", "Economic Reports", "Financial Ratios", "Market Analysis", "Interest Rates"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 2}, "votes": null}, {"id": 311, "created_at": "2024-08-23T03:30:57.281602+00:00", "title": "Indonesia's Foreign Investment Drops 22.41% in Q2 2024 Compared to Previous Quarter", "body": "Foreign investment in Indonesia's second quarter of 2024 decreased by 22.41% compared to the first quarter, reaching USD 4.89 billion, with the majority coming from ASEAN region, emerging market Asia, and the US. Meanwhile, portfolio investment saw a surplus of USD 3 billion in Q2 2024, a significant improvement from a deficit of USD 1.8 billion in Q1 2024, driven by a net foreign investment inflow of USD 4 billion.", "source": "https://www.idnfinancials.com/news/50675/foreign-investment-plummeted-q", "timestamp": "2024-08-22T11:32:34", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Foreign Investor", "Market Trends", "Economic Reports", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 201, "created_at": "2024-08-12T11:30:08.273763+00:00", "title": "Proposal to Upgrade National Committee Sharia Economy Finance to Development Institution in Next Government Term.", "body": "The National Committee for Sharia Economy and Finance in Jakarta is proposed to become a Sharia Economy Development Institution in the upcoming government term. The regulation for the upgrade is being discussed in an interministerial meeting, which, once approved, will give more autonomous control to the Committee and elevate it to a ministry-level institution directly coordinated by the president.", "source": "https://www.idnfinancials.com/news/50568/kneks-aims-gain-status-bpes", "timestamp": "2024-08-09T17:00:56", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Sharia Economy", "IDX"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 232, "created_at": "2024-08-16T04:11:10.241296+00:00", "title": "Indocement's Profit Drops 37.75% in First Semester 2024 Despite 2% Revenue Growth.", "body": "PT Indocement Tunggal Perkasa's revenue grew 2% to IDR 8.12 trillion in the first semester of 2024, but its profit fell 37.75% to IDR 434.70 billion due to a decline in gross profit margin from 30.50% to 28.28%. The company's cement product segment remained the largest contributor to sales, accounting for IDR 7.44 trillion, while ready-mix concrete and mining aggregate segments contributed IDR 652.93 billion and IDR 26.35 billion, respectively.", "source": "https://www.idnfinancials.com/news/50581/intp-profit-declines", "timestamp": "2024-08-12T15:21:55", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Earnings Report", "IDX", "Mixed."], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 285, "created_at": "2024-08-21T03:27:29.016436+00:00", "title": "President Joko Widodo Appoints Three New Ministers in Latest Cabinet Reshuffle", "body": "President Joko Widodo has appointed three new ministers to his Indonesia Maju cabinet, including Supratman Andi Agtas as Minister of Law and Human Rights, Bahlil Lahadalia as Minister of Energy and Mineral Resources, and Roslan Roeslani as Minister of Investment. This reshuffle marks a significant shift in party representation, with Gerindra and Golkar gaining key positions, while PDIP retains only one ministry-level position.", "source": "https://www.idnfinancials.com/news/50627/nearing-terms-end-jokowi-inaugurates-ministers", "timestamp": "2024-08-19T09:38:23", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Executive Changes", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 2, "sustainability": 0}, "votes": null}, {"id": 129, "created_at": "2024-08-12T09:35:37.559849+00:00", "title": "Menara Syariah & Inceif University Symposium 2024 to Focus on Islamic Financial Principles and Digital Innovations for Sustainable Development.", "body": "Menara Syariah Inceif University hosts the 1st symposium in August 2024 to promote the adoption of Islamic financial principles amidst global challenges. The event features discussions on modern waqf management, sustainability, and sharia investment regulation, emphasizing the transformative potential of focusing on waqf for sustainable development in the Islamic finance industry. Prof. Mohammad Nuh highlights the significance of technology partnerships for waqf 2.0 paradigm shift and aims to integrate digital solutions with ethical finance principles for achieving sustainable development goals.", "source": "https://www.idnfinancials.com/news/50557/msius-promotes-modern-waqf-practices-islamic-collaboration-investments", "timestamp": "2024-08-08T15:38:30", "sector": "financials", "sub_sector": ["banks"], "tags": ["Sharia Economy", "Fintech"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 2}, "votes": null}, {"id": 202, "created_at": "2024-08-12T11:30:12.878925+00:00", "title": "Indonesia's Global Sukses Digital Sets Double-Digit Revenue Growth Target for 2024 after Impressive Start on Stock Exchange.", "body": "PT Global Sukses Digital Tbk debuted on the Indonesia Stock Exchange, aiming for double-digit profit and revenue growth by 2024, reporting revenue increase of 12.6% YOY in H1 2024 and a 26% YOY rise in profits. The company targets to reach revenue of IDR 684.76 billion and a net profit of IDR 28.71 billion in 2024, showing optimistic performance compared to recent one-year-old stock issuers. The stock price skyrocketed by 88.15% since its IPO, closing at IDR 254 per share.", "source": "https://www.idnfinancials.com/news/50567/debuting-doss-reveals-target", "timestamp": "2024-08-09T16:30:20", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["IDX", "IPO", "IDX Composite", "Earnings Report", "Market Trends"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 382, "created_at": "2024-09-03T03:31:28.421616+00:00", "title": "Indonesia's inflation rate slows down to 2.12% in August 2024, driven by price surges in various expense groups.", "body": "Indonesia's inflation rate slowed down to 2.12% in August 2024, a decrease from 3.27% in August 2023, with a year-to-date inflation rate of 0.87%. The inflation rate has been trending downward since April 2024, with the highest inflation rate recorded in Highland Papua at 5.05% and the lowest in Bangka Belitung Islands at 1.02%.", "source": "https://www.idnfinancials.com/news/50788/august-inflation-lowered", "timestamp": "2024-09-02T13:43:37", "sector": "", "sub_sector": ["none"], "tags": ["Inflation", "Market Trends", "IDX", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 435, "created_at": "2024-09-07T03:34:47.753066+00:00", "title": "Star Energy Group Holdings subsidiary signs USD 655 million credit facility agreement with Bangkok Bank.", "body": "Star Energy Group Holdings Pte Ltd has signed a USD 655 million credit facility agreement with Bangkok Bank, with amended terms including a lower margin of 2.50% above the secured overnight financing rate and a delayed final payment date of August 30, 2029. The company's stock price corrected 2.89% to IDR 10,950 per share following the announcement.", "source": "https://www.idnfinancials.com/news/50824/brens-subsidiary-signs-relaxation-credit", "timestamp": "2024-09-05T10:24:10", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Debt", "Interest Rates", "IDX", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 390, "created_at": "2024-09-05T03:35:54.630464+00:00", "title": "Indonesia's international investment position shows net liabilities of USD 247.3 billion in Q2 2024, down from USD 253.9 billion in Q1 2024.", "body": "Indonesia's international investment position (IIP) in Q2 2024 reported net liabilities of USD 247.3 billion, down from USD 253.9 billion in Q1 2024, driven by higher foreign financial assets (USD 491.48 billion) and lower foreign financial liabilities (USD 738.74 billion). The IIP-to-GDP ratio decreased to 18.1% in Q2 2024 from 18.4% in Q1 2024, with long-term instruments, particularly direct investment, dominating the IIP liabilities structure.", "source": "https://www.idnfinancials.com/news/50813/q-international-investment-position-liabilities", "timestamp": "2024-09-04T10:51:40", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Economic Reports", "Market Trends", "Market Sentiment", "Interest Rates", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 404, "created_at": "2024-09-05T03:37:53.315343+00:00", "title": "Sunaie, a former grocery store owner, becomes a successful Brilink agent and UMI partner, helping many people in her community access financial services and escape financial problems.", "body": "Sunaie, a grocery store owner, has successfully become a BRILink agent and UMI partner, serving dozens of customers with total loans reaching hundreds of millions, with an average loan of Rp 5-10 million per person to support local businesses. As a BRILink agent and UMI partner, Sunaie has improved her economy and helped people around her escape financial difficulties, with the goal of building a micro-economic ecosystem through loan distribution.", "source": "https://www.idnfinancials.com/news/50791/bringing-financial-access-closer-heres-success-story-sunaie-brilink-agent-umi-partner", "timestamp": "2024-09-02T15:43:09", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Fintech", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 2}, "votes": null}, {"id": 476, "created_at": "2024-09-10T07:30:22.668779+00:00", "title": "Federal Reserve Signals Rate Cuts in September as Powell Emphasizes Cooling Labor Market", "body": "Federal Reserve Chairman Jerome Powell signaled that interest rate cuts will begin in September, validating market expectations, and his comments on a \"cooling labor market\" suggest the Fed will do whatever it takes to avoid a pronounced economic slowdown. The news sent stocks rallying, with the S&P 500 gaining over 1%, and bond yields tumbling, with the 2-year yield breaking below 4%, as investors cheered the prospect of rate cuts.", "source": "https://finance.yahoo.com/news/stocks-bonds-fall-traders-rethink-223141141.html", "timestamp": "2024-08-23T06:03:37", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bonds", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 489, "created_at": "2024-09-11T05:28:16.833914+00:00", "title": "European Business Group Urges China to Reform Economy to Boost Investor Confidence", "body": "The European Chamber of Commerce in China has warned that business confidence in China has hit an all-time low, with profit margins for two-thirds of companies surveyed at or below global averages, due to lagging domestic demand and overcapacity in certain industries. The Chamber has proposed over 1,000 recommendations to address these challenges, including introducing policies to boost domestic demand and refraining from punishing companies for actions taken by their home governments, to restore investor confidence and prevent a trade war.", "source": "https://finance.yahoo.com/news/european-business-confidence-china-time-040453478.html", "timestamp": "2024-09-11T04:04:53", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Market Sentiment", "Economic Reports", "Market Trends", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 1}, "votes": null}, {"id": 490, "created_at": "2024-09-11T05:28:44.664367+00:00", "title": "Oil Price Drop to $60 a Barrel Could Boost Economic Growth and Ease Inflation Concerns", "body": "The decline in global benchmark Brent crude oil prices to below $70 a barrel, with forecasts suggesting a potential drop to $60 a barrel by 2025, could lead to interest rate cuts and boost economic growth, as lower oil prices would reduce headline inflation rates and increase consumer disposable income. This development could have a significant impact on the US and European economies, with analysts predicting a 0.4 percentage point drop in inflation rates and a 0.2 percentage point gain in economic growth in the US, UK, and euro area.", "source": "https://finance.yahoo.com/news/oil-fall-60s-widens-runway-040000359.html", "timestamp": "2024-09-11T04:00:00", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Inflation", "Interest Rates", "Energy Commodities", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 492, "created_at": "2024-09-11T05:29:08.85935+00:00", "title": "Asian Markets Slip as US Presidential Debate Sparks Investor Caution", "body": "Asian markets and US stock futures slipped on Wednesday after the US presidential debate, with MSCI's broadest index of Asia-Pacific shares outside Japan dropping 0.25% and S&P 500 futures easing 0.38%, as investors await US inflation data that could influence the Federal Reserve's policy moves next week. The dollar remained defensive, with a 0.21% decline, while the yen strengthened 0.6% to its highest level since January, and oil prices stabilized after a 3% drop the previous session.", "source": "https://finance.yahoo.com/news/asian-stocks-shaky-ahead-us-005459037.html", "timestamp": "2024-09-11T03:11:39", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Inflation", "Interest Rates", "Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 493, "created_at": "2024-09-11T05:29:18.639411+00:00", "title": "Australian Central Bank Expects Labour Market to Continue Easing Towards Balance Amid High Interest Rates.", "body": "The Reserve Bank of Australia (RBA) expects the labour market to continue easing, with unemployment rising to 4.2% in July, as high interest rates slow demand, but the market remains tighter than estimated, with strength in hours worked and participation. Despite this, the RBA has raised interest rates to a 12-year high of 4.35% to tame inflation, and policymakers believe a rate cut this year is unlikely, although markets predict an 84% probability of a December rate cut.", "source": "https://finance.yahoo.com/news/australias-tight-labour-market-set-002413281.html", "timestamp": "2024-09-11T00:24:13", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Inflation", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 494, "created_at": "2024-09-11T05:29:30.864206+00:00", "title": "Analysts' earnings expectations for the third quarter have been slashed, but experts say this could set the stage for a fourth-quarter rally in stocks.", "body": "Analysts have slashed earnings expectations for the current quarter by 2.8%, which is relatively normal, and companies are expected to beat these lowered estimates, setting the stage for a potential fourth-quarter rally. Earnings are expected to grow 4.9% year-over-year in the third quarter, with consensus expecting double-digit earnings growth throughout 2025, supporting a broadening market rally.", "source": "https://finance.yahoo.com/news/wall-street-is-cutting-q3-earnings-estimates--why-thats-not-a-cause-for-worry-154838597.html", "timestamp": "2024-09-10T15:48:41", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Market Analysis", "Valuation", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 495, "created_at": "2024-09-11T05:29:40.802431+00:00", "title": "Crude oil prices rebound amid concerns over Tropical Storm Francine's potential supply disruption.", "body": "Crude prices rebounded on Wednesday, with Brent crude futures rising 0.6% to $69.58 a barrel and US crude futures increasing 0.7% to $66.19 a barrel, driven by concerns about Tropical Storm Francine disrupting supply. The rebound came after a sharp drop on Tuesday, when Brent hit its lowest level since December 2021 and US crude fell to a May 2023 trough, following OPEC+'s revised down demand forecast for 2024 and 2025.", "source": "https://finance.yahoo.com/news/oil-prices-rebound-fears-supply-012444633.html", "timestamp": "2024-09-11T01:24:44", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 496, "created_at": "2024-09-11T05:29:53.594032+00:00", "title": "Asian Markets Await US Inflation Data Amid Sliding Oil Prices and Cautious Sentiment", "body": "As investors await Wednesday's US consumer price inflation figures, a potential decline in inflation could lead to lower interest rates, weighing on treasury yields and the dollar, and boosting Asian emerging market assets. Meanwhile, oil commodity prices have slid, with Brent crude oil down 25% and US gasoline prices 30% cheaper than last year, signaling accelerating disinflationary dynamics that could put downward pressure on next year's inflation readings.", "source": "https://finance.yahoo.com/news/morning-bid-disinflation-dynamics-deepen-215126474.html", "timestamp": "2024-09-10T21:51:26", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Inflation", "Interest Rates", "Market Trends", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 502, "created_at": "2024-09-12T04:18:33.186557+00:00", "title": "China advises carmakers to keep advanced electric vehicle technology domestic amid global expansion", "body": "China has advised its carmakers to keep advanced electric vehicle technology within the country, even as they build factories abroad to escape tariffs, and has instructed them to export \"knock-down kits\" for final assembly in destination markets. This directive may hurt Chinese automakers' efforts to globalize and could impact their plans to invest in countries like Turkey, Spain, and Hungary, potentially affecting their bottom lines and local economic boosts.", "source": "https://finance.yahoo.com/news/china-asks-carmakers-keep-key-021306048.html", "timestamp": "2024-09-12T02:13:06", "sector": "consumer-cyclicals", "sub_sector": ["automobiles-components"], "tags": ["Market Trends", "Economic Reports", "Foreign Investor", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 503, "created_at": "2024-09-12T04:18:45.683667+00:00", "title": "Asian shares rally, tracking Wall Street gains, as investors await European Central Bank's policy decision.", "body": "Asian shares rallied, with MSCI's broadest index of Asia-Pacific shares outside Japan rising 1%, as investors awaited the European Central Bank's policy decision, while the US dollar held onto gains after US core inflation surprised slightly on the upside, dashing hopes for a large rate cut by the Federal Reserve next week. The yield on 2-year US Treasuries rose 4 basis points to 3.3193%, while Brent crude futures gained 2% to $70.65 a barrel, and gold traded at $2,513.75 an ounce, just below its record high.", "source": "https://finance.yahoo.com/news/asian-shares-wall-st-tech-020817408.html", "timestamp": "2024-09-12T02:08:17", "sector": "financials", "sub_sector": ["banks"], "tags": ["Inflation", "Interest Rates", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 504, "created_at": "2024-09-12T04:18:59.713602+00:00", "title": "Nvidia CEO Jensen Huang touts AI infrastructure investment returns and productivity gains at Goldman Sachs conference.", "body": "Nvidia's stock surged 6% on Wednesday, driven by CEO Jensen Huang's discussion on the return on investment (ROI) of AI infrastructure at the Goldman Sachs conference, highlighting the company's ability to provide immediate cost savings to customers through its GPU-based accelerators. Huang emphasized that Nvidia's technology can reduce computing time by 20 times, resulting in 10x savings, and that every dollar spent on Nvidia's solutions translates to $5 worth of rentals, demonstrating a strong ROI for customers.", "source": "https://finance.yahoo.com/news/nvidia-stock-jumps-ceo-jensen-021610291.html", "timestamp": "2024-09-12T02:16:10", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Conferences", "Executive Changes", "Artificial Intelligence", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 2, "management": 2, "sustainability": 0}, "votes": null}, {"id": 506, "created_at": "2024-09-12T04:19:31.6833+00:00", "title": "Micron Technology and Peers Report Mixed Q2 Earnings Amid Semiconductor Industry Volatility", "body": "Micron Technology reported Q2 revenues of $6.81 billion, up 81.5% year-over-year, exceeding analysts' expectations by 2%, but its stock is down 39.3% since reporting, currently trading at $86.50. Other semiconductor companies, including Himax Technologies, Lattice Semiconductor, Macom Technology Solutions, and Teradyne, also reported mixed Q2 results, with some beating expectations and others falling short, resulting in varying stock price performances.", "source": "https://finance.yahoo.com/news/q2-earnings-highlights-micron-technology-074249121.html", "timestamp": "2024-09-11T07:42:49", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 507, "created_at": "2024-09-12T04:19:46.952076+00:00", "title": "Okta CEO says macroeconomic uncertainty is weighing on software demand, but remains confident in company's growth prospects.", "body": "Okta's CEO Todd McKinnon attributed the company's slower growth to macroeconomic uncertainty, which has led companies to rationalize their technology spending and justify investments, resulting in a more muted spending backdrop. Despite delivering strong Q2 results with 16% revenue growth and achieving profitability on a GAAP basis, Okta's guidance was lower than expected, with adjusted earnings per share expected to range from $0.57 to $0.58 in Q3, below analysts' estimates of $0.59.", "source": "https://finance.yahoo.com/news/companies-are-being-careful-with-software-spending-okta-ceo-says-215622502.html", "timestamp": "2024-09-11T21:56:22", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Sentiment", "Interest Rates", "Inflation", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 2, "sustainability": 0}, "votes": null}, {"id": 508, "created_at": "2024-09-12T04:20:07.345906+00:00", "title": "Nvidia CEO Jensen Huang says demand for company's technology is \"emotional\" and will expand beyond data centers.", "body": "Nvidia CEO Jensen Huang emphasized the company's crucial role in the AI revolution, stating that every dollar spent by cloud service providers on Nvidia translates to $5 worth of rentals, and that the company's technology will expand beyond data centers. Despite recent sell-offs, Nvidia's stock is up nearly 150% in the last 12 months, and Huang remains optimistic about the company's future, citing the enormous time savings and competitiveness boost that AI models bring to customers.", "source": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-everybody-is-counting-on-us-174749007.html", "timestamp": "2024-09-11T17:47:49", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Executive Changes", "Artificial Intelligence", "Market Trends", "Market Sentiment", "Bullish", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 1, "management": 2, "sustainability": 0}, "votes": null}, {"id": 509, "created_at": "2024-09-12T04:20:18.812152+00:00", "title": "Housing inflation remains stubbornly high, with shelter costs rising 0.5% in August and 5.2% annually, defying expectations of a slowdown.", "body": "The latest Consumer Price Index (CPI) report showed that housing inflation remains stubborn, with shelter costs rising 0.5% month-over-month in August and 5.2% year-over-year, defying expectations of a slowdown in rent increases. Despite an influx of new apartment supply, the trend has been slow to show up in the CPI report, with economists still expecting a deceleration in rental prices, but the exact timing remains uncertain.", "source": "https://finance.yahoo.com/news/housing-inflation-the-only-real-standout-surprise-of-august-cpi-report-153301117.html", "timestamp": "2024-09-11T15:33:01", "sector": "consumer-cyclicals", "sub_sector": ["consumer-services"], "tags": ["Inflation", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 523, "created_at": "2024-09-13T04:18:57.617313+00:00", "title": "GE Vernova shares hit record high after reaffirming full-year guidance and predicting profitable offshore wind division.", "body": "GE Vernova's shares closed at a record high of $215.27, up 2.9%, after the company reaffirmed its full-year guidance, expecting revenue at the higher end of its $34-35 billion range, driven by strength in its power electrification segments. The company's offshore wind division, which is projected to post a $300 million loss in Q3, is expected to be profitable in Q4, contributing to the company's strong financial outlook.", "source": "https://finance.yahoo.com/news/why-ge-vernova-stock-jumped-223205933.html", "timestamp": "2024-09-12T22:32:05", "sector": "energy", "sub_sector": ["alternative-energy"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 525, "created_at": "2024-09-13T04:19:33.662106+00:00", "title": "Semiconductor Stocks' Q2 Earnings: Winners and Losers in a Mixed Quarter", "body": "Among the 41 semiconductor stocks tracked, revenues beat analysts' consensus estimates by 1.3%, but next quarter's revenue guidance was 4.4% below, with average share prices down 6.6% since the latest earnings results. Notable performers included Western Digital, which reported a 40.9% year-over-year revenue increase, and Lam Research, which topped analysts' expectations with a 20.7% year-over-year revenue growth, while Lattice Semiconductor disappointed with a 34.7% year-over-year revenue decline.", "source": "https://finance.yahoo.com/news/q2-earnings-outperformers-western-digital-084130460.html", "timestamp": "2024-09-12T08:41:30", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "IDX", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 526, "created_at": "2024-09-13T04:19:44.663159+00:00", "title": "Oil prices rise as Hurricane Francine disrupts US Gulf of Mexico production, breaking streak of weekly declines.", "body": "Oil prices rose on Friday, with Brent crude futures up 0.5% to $72.31 per barrel and US West Texas Intermediate crude futures up 0.6% to $69.36 per barrel, set to break a streak of weekly declines despite a rough start to the week. The gains are driven by output disruptions in the US Gulf of Mexico due to Hurricane Francine, but demand concerns persist, with forecasts for oil demand growth lowered by OPEC and the IEA, citing economic struggles in China and soft demand in other countries.", "source": "https://finance.yahoo.com/news/oil-prices-extend-recovery-rally-011528140.html", "timestamp": "2024-09-13T01:15:28", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 540, "created_at": "2024-09-13T04:40:30.460109+00:00", "title": "Ministry of Finance Receives Proposal to Increase Excise Rate on Packaged Sugary Drinks to 2.5 Percent", "body": "The Indonesian Ministry of Finance has received a proposal to increase the excise rate on packaged sugary drinks to 2.5%, aiming to reduce the negative impact of sugary drinks and increase state revenues. The implementation decision will be left to the next government, with a recommended gradual increase to 20% by 2025, which is expected to reduce dependence on excise taxes from tobacco products.", "source": "https://www.idnfinancials.com/news/50873/ministry-finance-accepts-dpr-proposal-excise-tax-sugary-drinks", "timestamp": "2024-09-11T11:24:46", "sector": "consumer-non-cyclicals", "sub_sector": ["tobacco"], "tags": ["Inflation", "Market Trends", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 2}, "votes": null}, {"id": 544, "created_at": "2024-09-14T04:18:25.591776+00:00", "title": "China's home prices fall at slightly faster pace in August, underscoring waning effect of housing rescue plan.", "body": "China's new-home prices fell 0.73% in August, following a 0.65% decline in July, as the country's housing rescue plan struggles to contain the property downturn, with values of used homes dropping 0.95%. The prolonged slump in property values has deterred homebuyers, and despite government support, shares of Chinese developers have slid into a bear market, with a Bloomberg Intelligence gauge dropping over 40% from its mid-May high.", "source": "https://finance.yahoo.com/news/china-home-prices-drop-accelerates-021959504.html", "timestamp": "2024-09-14T02:19:59", "sector": "properties-real-estate", "sub_sector": ["properties-real-estate"], "tags": ["Market Trends", "Bearish", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 545, "created_at": "2024-09-14T04:18:44.565524+00:00", "title": "Smaller equity markets in Asia and beyond are outperforming larger ones as investors seek diversification and attractive valuations.", "body": "Smaller equity markets in Asia, such as Thailand, Singapore, and New Zealand, are outperforming larger markets, with their benchmarks rising at least 3% each in September, driven by attractive valuations, dovish central banks, and a shift in investor sentiment. These markets are benefiting from limited exposure to the artificial intelligence theme, lower valuations, and local tailwinds, making them attractive to investors seeking diversification and growth potential.", "source": "https://finance.yahoo.com/news/small-markets-steal-limelight-global-000000793.html", "timestamp": "2024-09-14T00:00:00", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Market Trends", "Market Sentiment", "Valuation", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 546, "created_at": "2024-09-14T04:19:01.682482+00:00", "title": "AI Stocks Rebound as Oracle and Nvidia Executives Address Concerns Over AI Returns", "body": "AI-related stocks, including Nvidia, Super Micro Computer, and Broadcom, surged nearly 20% this week, driven by bullish comments from Oracle's Larry Ellison and Nvidia's Jensen Huang, who addressed concerns about AI returns and infrastructure spend. Oracle shares soared 24% after Ellison's comments, while Nvidia shares rose 16% and Broadcom gained 21%, with the AI rally spreading throughout the tech sector and semiconductor stocks seeing a nearly 10% surge.", "source": "https://finance.yahoo.com/news/why-stock-markets-ai-trade-015219836.html", "timestamp": "2024-09-14T01:52:19", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Artificial Intelligence", "Bullish", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 2, "sustainability": 0}, "votes": null}, {"id": 559, "created_at": "2024-09-15T04:22:22.250917+00:00", "title": "Central Banks Prepare for Busy Week of Policy Decisions Amid Market Volatility", "body": "This week, central banks around the world, including the US Federal Reserve, Bank of Japan, and Bank of England, will make crucial decisions on interest rates, with the Fed likely to cut rates by 25-50 basis points, while the BoJ and BoE may hold or adjust their rates. The decisions will have significant implications for global markets, economies, and currencies, with investors closely watching for clues on future monetary policy and potential rate cuts or hikes in countries such as Brazil, South Africa, and Norway.", "source": "https://finance.yahoo.com/news/world-braces-fed-easing-amid-200000067.html", "timestamp": "2024-09-14T20:00:00", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 560, "created_at": "2024-09-15T04:24:16.984488+00:00", "title": "Indonesia's Vice Minister of Religion Calls for Capable Human Resources to Boost Sharia Economic Centre", "body": "Indonesia's Vice Minister of Religion, Saiful Rahmat Dasuki, emphasized the need for capable and reliable human resources to boost the country's Sharia economic center, aiming for a more inclusive and sustainable economy that benefits Muslim communities and promotes social justice. The Islamic Leaders Conference, featuring renowned speakers, discussed the importance of Sharia economy going beyond halal transactions to generate sustainable and fair welfare for people.", "source": "https://www.idnfinancials.com/news/50896/vice-minister-religion-high-quality-human-resources-required-sharia-economic-centre", "timestamp": "2024-09-12T14:37:21", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Sharia Economy", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 2}, "votes": null}, {"id": 563, "created_at": "2024-09-16T04:25:13.864078+00:00", "title": "Oil prices steady as Libyan export decline offsets concerns over China's economic slump.", "body": "Oil prices steadied near $72 a barrel after a weekly gain, despite Libyan export declines and signs of a deepening economic slump in China, which has pushed Brent down 17% this quarter. Hedge funds have turned net bearish on Brent for the first time since 2011, but some short positions are being unwound as prices recover, with Chinese demand weakness expected to persist until Beijing defends its 5% growth target.", "source": "https://finance.yahoo.com/news/oil-steadies-falling-libyan-exports-232844014.html", "timestamp": "2024-09-16T01:50:50", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bearish", "Market Trends", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 564, "created_at": "2024-09-16T04:25:16.303899+00:00", "title": "Oil prices rise slightly on expectations of US interest rate cut, but gains capped by weaker China data and demand worries.", "body": "Oil prices edged up on Monday, with Brent crude futures up 3 cents to $71.64 a barrel and US crude futures up 16 cents to $68.81 a barrel, as markets expect a US interest rate cut this week, which could boost economic activity and lift demand for oil. However, gains were capped by weaker China data and persistent demand worries, with oil refinery output falling for the fifth month and speculators taking a net short position in the ICE Brent market for the first time.", "source": "https://finance.yahoo.com/news/oil-prices-inch-fed-rate-004806373.html", "timestamp": "2024-09-16T00:48:06", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Interest Rates", "Energy Commodities", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 565, "created_at": "2024-09-16T04:25:18.719573+00:00", "title": "Gold surges to record highs, boosting investor enthusiasm, as commodity markets face challenges from climate change and shifting demand.", "body": "Gold prices have surged 25% this year, setting new records and boosting investor enthusiasm for gold miners, with the Bloomberg Intelligence Index of top producers rising over 30%. Meanwhile, premium gasoline and diesel futures have fallen, indicating a bearish sign for US refiners, and wheat prices have dropped 5.3% this year due to big supplies, benefiting cost-conscious millers and bakers.", "source": "https://finance.yahoo.com/news/five-key-charts-watch-global-210000741.html", "timestamp": "2024-09-15T21:00:00", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Gold", "Metals and Minerals", "Market Trends", "Bullish", "Energy Commodities", "Mixed"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 2}, "votes": null}, {"id": 566, "created_at": "2024-09-16T04:25:27.590635+00:00", "title": "Analysts recommend shifting to defensive shares and non-tech growth companies as AI rally shows signs of being overextended amid changing macro conditions.", "body": "As macroeconomic conditions change, analysts are recommending defensive shares over AI plays, with utility stocks gaining 22.08% year-to-date, going toe-to-toe with the tech sector's 25.69% gain, and defensive sectors expected to perform better in softening economic conditions. Meanwhile, AI names have struggled, with the broader S&P Global Semiconductor Index down 5.63% this month, leading analysts to suggest investors take shelter in defensive corners of the stock market, such as dividend-paying utilities and real estate.", "source": "https://finance.yahoo.com/news/resist-temptation-ai-bet-safe-203102474.html", "timestamp": "2024-09-15T20:31:02", "sector": "infrastructures", "sub_sector": ["utilities"], "tags": ["Market Trends", "Market Sentiment", "Interest Rates", "Dividends", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 1, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 571, "created_at": "2024-09-17T04:22:27.36127+00:00", "title": "Cryptocurrencies Defy Expectations with Sudden Slump Ahead of Anticipated Federal Reserve Rate Cut", "body": "Cryptocurrencies, including Bitcoin Cash, Stacks, and Polygon, plummeted this week, with some experiencing losses of up to 11%, despite expectations of a rate cut by the Federal Reserve, which could boost their popularity. However, inflows into crypto exchange-traded funds remained robust, with over $263 million injected into Bitcoin funds, indicating strong demand and potential for a recovery or rally if the Fed announces a rate cut.", "source": "https://finance.yahoo.com/news/why-altcoins-were-plummeting-monday-010400672.html", "timestamp": "2024-09-17T01:04:00", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Interest Rates", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 572, "created_at": "2024-09-17T04:23:28.459456+00:00", "title": "Cathedra Bitcoin to Shift from Mining to Data Center Services and Buying Bitcoin on Open Market", "body": "Cathedra Bitcoin is pivoting away from bitcoin mining due to unpredictable profit margins, instead opting to provide general data center services and buying bitcoin on the open market, aiming to accumulate more bitcoin per share for its shareholders. The company will use profits from its data center business, as well as debt, equity, and bitcoin-linked derivatives, to buy more bitcoin, with its current balance sheet holding 43 bitcoin.", "source": "https://finance.yahoo.com/news/another-bitcoin-miner-adopts-microstrategys-205915583.html", "timestamp": "2024-09-16T20:59:15", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["Debt", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 590, "created_at": "2024-09-18T03:32:38.833539+00:00", "title": "Indonesia's trade surplus drops 6.96% year-on-year to USD 2.89 billion in August 2024.", "body": "Indonesia's trade surplus in August 2024 dropped 6.96% year-on-year to USD 2.89 billion, with non-oil and gas commodities contributing a surplus of USD 4.34 billion, while oil and gas saw a deficit of USD 1.44 billion. The country's trade surplus for the January-August 2024 period also decreased by 22.49% year-on-year to USD 18.84 billion, with total exports reaching USD 173.92 billion and total imports reaching USD 155.08 billion.", "source": "https://www.idnfinancials.com/news/50921/august-trade-surplus-dropped-yoy", "timestamp": "2024-09-17T11:52:42", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 595, "created_at": "2024-09-20T04:21:21.900853+00:00", "title": "China Keeps Benchmark Lending Rates Unchanged Amid Economic Slowdown", "body": "The People's Bank of China (PBOC) maintained its benchmark lending rates in September, with the one-year loan prime rate staying at 3.35% and the five-year rate remaining at 3.85%, as policymakers hold off on further monetary stimulus despite record-low profit margins for financial institutions. Expectations are building that easing is imminent, with economists predicting a rate cut of at least 10 basis points in the fourth quarter to revive the economy, which is struggling to meet its 5% growth target this year.", "source": "https://finance.yahoo.com/news/china-banks-maintain-key-lending-010144024.html", "timestamp": "2024-09-20T02:26:27", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 596, "created_at": "2024-09-20T04:21:33.218812+00:00", "title": "China leaves benchmark lending rates unchanged, defying expectations, but further stimulus expected to prop up ailing economy.", "body": "China's central bank unexpectedly left benchmark lending rates unchanged, defying market expectations, but analysts believe further stimulus will be rolled out to prop up the ailing economy, with a rate cut likely to be included in a larger policy package. The current economic data and expectations support a rate cut, which could lead to a significant decline in loan prime rates in the fourth quarter, helping to meet China's increasingly challenging 2024 growth target.", "source": "https://finance.yahoo.com/news/china-unexpectedly-leaves-lending-rates-010743857.html", "timestamp": "2024-09-20T01:07:43", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Economic Reports", "Recession", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 597, "created_at": "2024-09-20T04:21:42.934778+00:00", "title": "Oil prices rise for second straight week on interest rate cut and declining global stockpiles.", "body": "Oil prices are set to end the week higher, with Brent futures gaining 4.3% and US crude rising 4.8%, driven by a large cut in US interest rates and declining global stockpiles, which have fallen to a one-year low in the US. Despite weak demand from China's slowing economy, crude prices are expected to remain supported in the $70-$75 range during the next quarter, according to Citi analysts, amid rising tensions in the Middle East.", "source": "https://finance.yahoo.com/news/oil-prices-set-end-week-004642752.html", "timestamp": "2024-09-20T00:46:42", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Interest Rates", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 598, "created_at": "2024-09-20T04:22:26.249866+00:00", "title": "Meituan's focus on lower prices helps Chinese food delivery company beat sales targets despite slowing economy.", "body": "Meituan, a Chinese food delivery company, has beaten sales targets despite a slowing economy, driven by its lower-price strategy and successful group-based ordering platform, Pin Hao Fan, which has attracted customers and restaurants. However, investors are cautious about the company's ability to sustain its growth rate in a deflationary environment, with concerns over competition, macro weakness, and valuations, which may limit further upside for its stock.", "source": "https://finance.yahoo.com/news/meituan-63-stock-surge-faces-003000052.html", "timestamp": "2024-09-20T00:30:00", "sector": "transportation-logistic", "sub_sector": ["logistics-deliveries"], "tags": ["Market Trends", "Market Sentiment", "Valuation", "Financial Ratios", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 1}, "votes": null}, {"id": 622, "created_at": "2024-09-21T04:18:03.065319+00:00", "title": "Industrial Packaging Stocks Report Mixed Q2 Earnings Amid Economic Uncertainty", "body": "Industrial packaging stocks reported satisfactory Q2 results, with revenues missing analysts' consensus estimates by 0.7% and next quarter's revenue guidance 2.3% below, but share prices have been resilient, up 7.5% on average since latest earnings results. Sealed Air, Avery Dennison, Silgan Holdings, Graphic Packaging Holding, and Berry Global Group reported mixed results, with some beating analyst estimates and others falling short, but most stocks have seen an increase in price since reporting.", "source": "https://finance.yahoo.com/news/unpacking-q2-earnings-sealed-air-084734148.html", "timestamp": "2024-09-20T08:47:34", "sector": "consumer-non-cyclicals", "sub_sector": ["nondurable-household-products"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 623, "created_at": "2024-09-21T04:18:15.421684+00:00", "title": "Federal Reserve Governor Michelle Bowman Dissents on Jumbo Rate Cut, Citing Inflation Concerns", "body": "Federal Reserve Governor Michelle Bowman dissented from the Fed's decision to cut interest rates by 0.5 percentage points, arguing that a smaller 0.25 percentage point cut would have been more appropriate given that inflation remains above the 2% target. The Fed's rate-setting committee is divided on future rate cuts, with seven members favoring an additional 0.25 percentage point cut and nine members favoring 0.5 percentage points of additional easing before year-end.", "source": "https://finance.yahoo.com/news/fed-dissenter-bowman-preferred-smaller-rate-cut-because-we-have-not-yet-achieved-our-inflation-goal-174837839.html", "timestamp": "2024-09-20T17:51:10", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Inflation", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 637, "created_at": "2024-09-23T04:21:53.981083+00:00", "title": "China's Housing Rescue Package Falls Short, Economists Say", "body": "China's housing rescue package is seen as the best path to put the country's economy back on track to expand around 5%, but its slow implementation has been insufficient to address the real estate crisis, which is expected to last for another 2-5 years. The economy is expected to grow 4.8% this year in real terms, but nominal growth will likely be lower at 4.25%, and more forceful implementation of the government-led plan is needed to avoid a contractionary nominal GDP.", "source": "https://finance.yahoo.com/news/economists-urge-china-ramp-housing-220000253.html", "timestamp": "2024-09-23T03:07:12", "sector": "properties-real-estate", "sub_sector": ["properties-real-estate"], "tags": ["Inflation", "Economic Reports", "Market Trends", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 638, "created_at": "2024-09-23T04:21:56.691448+00:00", "title": "Gold hits record high ahead of key US economic data and Fed rate decisions.", "body": "Gold prices surged to a record high of $2,625.89 per ounce, beating the previous all-time high, as traders anticipate crucial economic data and weigh the outlook for interest rates ahead of the Federal Reserve's next policy meetings. The Bloomberg Dollar Spot Index remained stable, while silver, palladium, and platinum prices declined, as market participants assess the likelihood of further rate cuts and escalating tensions in the Middle East.", "source": "https://finance.yahoo.com/news/gold-steady-near-record-high-000758841.html", "timestamp": "2024-09-23T02:55:59", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Gold", "Interest Rates", "Market Trends", "Metals and Minerals", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 639, "created_at": "2024-09-23T04:22:15.07888+00:00", "title": "Asian Stocks Rise Ahead of Central Bank Meetings and Key US Inflation Figures", "body": "Asian stocks rose ahead of central bank meetings, with China's central bank surprising markets by cutting its 14-day repo rate, while the S&P 500 futures firmed 0.3% and Nasdaq futures added 0.5%, with the S&P 500 up 1% so far in September and 19% year-to-date. Markets are expecting further rate cuts, with a 50% probability of another outsized move in November, and analysts noting that the Fed's determination to avoid a deterioration in labor market conditions could lead to a soft landing.", "source": "https://finance.yahoo.com/news/asia-stocks-hold-steady-more-003529156.html", "timestamp": "2024-09-23T01:54:09", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 640, "created_at": "2024-09-23T04:22:52.263529+00:00", "title": "Carnival CEO says record revenue and profit driven by compounding demand and yield management, not pent-up demand.", "body": "Carnival Corporation reported record revenue of $5.78 billion and operating profit in the second quarter, with adjusted earnings of 11 cents per share, beating Wall Street's expectations, and raised its 2024 adjusted net income guidance to $1.55 billion. The company's shares are up 2.4% year-to-date and 26% from last year, with analysts expecting further upside due to strong demand, lower fuel prices, and improving operating leverage.", "source": "https://finance.yahoo.com/news/analysts-retool-carnival-stock-price-230300733.html", "timestamp": "2024-09-22T23:03:00", "sector": "consumer-cyclicals", "sub_sector": ["leisure-goods"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Bullish", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 1, "sustainability": 0}, "votes": null}, {"id": 641, "created_at": "2024-09-23T04:23:05.873773+00:00", "title": "Global Commodity Markets Show Mixed Signals Amid Oil Refining Margin Rebound and Devastating African Floods", "body": "Oil refining margins are showing signs of recovery, with brent hydroskimming margins rebounding from a 10-month low, which could boost crude prices in the short term. Meanwhile, lithium prices remain sluggish despite output adjustments at China's largest mine, as battery metal suppliers continue to struggle with oversupply and slowing electric-vehicle adoption.", "source": "https://finance.yahoo.com/news/five-key-charts-watch-global-210000978.html", "timestamp": "2024-09-22T21:00:00", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 642, "created_at": "2024-09-23T04:23:23.129292+00:00", "title": "Google's potential breakup due to antitrust concerns may not be a bad thing for investors, as history shows that similar breakups can lead to increased value and innovation.", "body": "If Google is forced to break up due to antitrust concerns, its existing shareholders may benefit from a scaled-back company that could boost innovation and customer service, potentially increasing its market value. The breakup could also lead to the creation of new companies that could become giants in their respective industries, similar to what happened with Standard Oil's divestiture, which increased its market cap five- to six-fold and made its shareholders richer.", "source": "https://finance.yahoo.com/news/the-potential-investor-upside-of-a-google-breakup--if-john-rockefeller-is-any-guide-133059958.html", "timestamp": "2024-09-22T13:30:59", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Market Trends", "Market Sentiment", "Mergers & Acquisitions", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 656, "created_at": "2024-09-24T04:21:10.898824+00:00", "title": "Asian shares rise, led by Chinese markets, after central bank announces measures to support economy", "body": "Asian shares advanced, with Chinese markets logging the biggest gains after the People's Bank of China announced measures to support the economy, including a 0.5 percentage point cut in the reserve requirement for banks, which would free up more money for lending. The Hang Seng index in Hong Kong surged over 400 points, while the Shanghai Composite Index rose 0.9%, and US futures edged lower, with the S&P 500 and Dow Jones Industrial Average closing at record highs on Monday.", "source": "https://finance.yahoo.com/news/stock-market-today-asian-shares-032200745.html", "timestamp": "2024-09-24T03:22:00", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 657, "created_at": "2024-09-24T04:21:33.645748+00:00", "title": "Asian Stocks Rally as China Unveils Stimulus Measures to Boost Economy", "body": "China's central bank announced stimulus measures, including a stock stabilization fund and 800 billion yuan liquidity support, to reach this year's economic growth target, boosting Asian stocks and sending key benchmarks rallying at least 3%. The MSCI Asia Pacific Index climbed 0.7%, while China's 10-year government bond yield erased its drop, but analysts warn that fundamental woes, including deflationary pressure, remain unsolved and the rally may soon fizzle.", "source": "https://finance.yahoo.com/news/asian-stocks-eye-gains-fresh-224627383.html", "timestamp": "2024-09-24T03:09:40", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 658, "created_at": "2024-09-24T04:21:48.917154+00:00", "title": "Asian Stocks Rise to Highest in Over Two Years on Chinese Stimulus and US Rate Cut Expectations", "body": "Asian stocks surged to their highest level in over two years, driven by China's stimulus measures, including a 50-basis-point cut in bank reserves and reduced mortgage rates, which boosted Chinese stocks and pushed MSCI's Asia-Pacific shares outside Japan index 0.41% higher to 588.43. The US dollar remained under pressure, with the dollar index at 100.95, near a one-year low, as expectations of further US rate cuts and a dovish Fed supported market sentiment and undermined the dollar against growth-sensitive currencies.", "source": "https://finance.yahoo.com/news/asia-stocks-steady-ahead-rba-012012734.html", "timestamp": "2024-09-24T01:20:12", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Market Trends", "Interest Rates", "IDX Composite", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 661, "created_at": "2024-09-24T04:30:53.181602+00:00", "title": "PTPP Prepares IDR250 Billion to Repay Shelf Registration Bonds Due in 2024", "body": "PT PP TBK has set aside IDR250 billion to repay its shelf registration bonds, Series B, which will mature on November 27, 2024, with the funds coming from the company's internal cash reserves of IDR4.33 trillion as of June 2024. The bonds have an interest coupon of 8.5% per year and a single plus rating, with PT PP TBK also holding short-term and long-term debts totaling IDR4.71 trillion and IDR2.68 trillion, respectively.", "source": "https://www.idnfinancials.com/news/50967/ptpp-prepares-idr-pay-ob", "timestamp": "2024-09-23T12:06:41", "sector": "financials", "sub_sector": ["banks"], "tags": ["Debt", "Bonds", "Interest Rates", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 672, "created_at": "2024-09-25T04:23:52.50001+00:00", "title": "Chinese stocks surge, lifting regional markets and global rally, as dollar weakens on US macroeconomic data.", "body": "Chinese stocks surged 3.1% on Wednesday, lifting regional markets and extending the global rally, as the People's Bank of China cut medium-term lending rates and announced a broad-based stimulus package. The dollar weakened after weak US macroeconomic data, boosting the case for a second super-sized interest rate cut at the Federal Reserve's next meeting, while gold rose to a fresh all-time peak and Brent crude hovered near a three-week high.", "source": "https://finance.yahoo.com/news/china-stocks-soar-stimulus-afterglow-025109856.html", "timestamp": "2024-09-25T02:51:09", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 673, "created_at": "2024-09-25T04:24:04.662568+00:00", "title": "China's stimulus measures boost emerging markets stocks to highest level since April 2022.", "body": "Emerging markets' stocks surged to their highest level since April 2022, with the MSCI equity index rising 2% on Tuesday, driven by gains in Hong Kong-listed Chinese companies like Tencent and Alibaba, following China's introduction of new stimulus measures to boost its economy. The stimulus measures, including interest rate cuts and liquidity support, have boosted investor confidence, with the Stoxx Europe 600 index also climbing 0.9%, although some analysts remain cautious about the measures' impact on China's economic growth.", "source": "https://finance.yahoo.com/news/chinas-latest-stimulus-boosts-emerging-023037217.html", "timestamp": "2024-09-25T02:30:37", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Market Trends", "Interest Rates", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 674, "created_at": "2024-09-25T04:24:17.288411+00:00", "title": "Global AI market expected to reach $990 billion by 2027, driven by rapid adoption and growing demand for AI-related products and services.", "body": "The global market for AI-related products is expected to grow 40-55% annually, reaching $990 billion by 2027, driven by companies and governments adopting AI to boost efficiency, according to Bain & Co.'s fifth annual global technology report. The growth will lead to revenue of $780 billion to $990 billion, with demand for AI systems and larger data centers straining supply chains and potentially triggering shortages of semiconductors and other components.", "source": "https://finance.yahoo.com/news/ai-market-surge-near-1-020100649.html", "timestamp": "2024-09-25T02:01:00", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Artificial Intelligence", "Market Trends", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 675, "created_at": "2024-09-25T04:24:28.440382+00:00", "title": "TikTok to shut down its music streaming service by November 28 to focus on partnering with third-party streaming services.", "body": "TikTok will shut down its music streaming service on November 28, just two years after its launch, to focus on driving music listening value and partnering with third-party streaming services, rather than competing with them. The move marks a strategic shift for the company, which has faced disputes with music labels over compensation and AI protections, and comes as Spotify's stock ticks up 3% following the news.", "source": "https://finance.yahoo.com/news/tiktok-to-shutter-music-streaming-business-in-win-for-spotify-apple-150403636.html", "timestamp": "2024-09-24T21:14:31", "sector": "consumer-cyclicals", "sub_sector": ["media-entertainment"], "tags": ["Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 676, "created_at": "2024-09-25T04:24:49.716982+00:00", "title": "JPMorgan Chase CEO Jamie Dimon Expresses Concerns Over Global Instability and Inflation Uncertainty", "body": "JPMorgan Chase CEO Jamie Dimon expressed caution about the economy's long-term path, citing global instability and geopolitics as major concerns that could impact inflation and the economy, despite the Federal Reserve's recent rate cut. Dimon's skepticism is reflected in JPMorgan's financial projections, with the bank's COO warning that net interest income may be lower than expected due to falling rates, and expenses may run higher due to inflation and other investments.", "source": "https://finance.yahoo.com/news/geopolitics-emerges-as-jamie-dimons-chief-concern-for-economy-its-getting-worse-161729005.html", "timestamp": "2024-09-24T16:17:30", "sector": "financials", "sub_sector": ["banks"], "tags": ["Inflation", "Interest Rates", "Market Sentiment", "Economic Reports", "Executive Changes", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 2, "sustainability": 0}, "votes": null}, {"id": 701, "created_at": "2024-09-26T04:24:08.757314+00:00", "title": "Asian Stocks Extend Rally Despite Global Trend, Fueled by China's Stimulus Package", "body": "Asian stocks extended their rally on Thursday, with MSCI's broadest index of Asia-Pacific shares outside Japan rising over 1% to a two-year high, driven by optimism over China's stimulus package, while Japan's Nikkei surged 2.4% and Hong Kong's Hang Seng Index advanced 1.5%. The US dollar remained rangebound, with markets pricing in a 62% chance of a 50-basis-point rate cut at the Fed's November policy meeting, while oil prices edged up and spot gold held steady after scaling a record high.", "source": "https://finance.yahoo.com/news/asian-stocks-defy-wall-st-022914945.html", "timestamp": "2024-09-26T02:29:14", "sector": "infrastructures", "sub_sector": ["utilities"], "tags": ["Market Trends", "Interest Rates", "Gold", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 702, "created_at": "2024-09-26T04:24:25.594775+00:00", "title": "Man Group's Nick Wilcox Expects Chinese Stocks to Continue Rally Amid Ongoing Policy Support", "body": "Nick Wilcox, Managing Director at Man Group Plc, expects Chinese stocks to extend their rally due to continued policy support, defying skeptics who warn that gains will be fleeting, with the People's Bank of China's recent stimulus package and interest rate cuts providing an immediate jolt to stocks. Wilcox anticipates more demand-side easing measures to come, citing improving earnings and potential social welfare reform, which could boost domestic consumption and arrest the deflationary cycle, making Asia ex-Japan equities an attractive asset class.", "source": "https://finance.yahoo.com/news/man-group-defies-china-skeptics-011503447.html", "timestamp": "2024-09-26T01:15:03", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 2, "sustainability": 0}, "votes": null}, {"id": 703, "created_at": "2024-09-26T04:24:46.125891+00:00", "title": "Electrical Systems Stocks Report Mixed Q2 Earnings Amid Economic Uncertainty", "body": "Electrical systems stocks have reported strong Q2 results, with revenues beating analysts' consensus estimates by 1.6% and next quarter's revenue guidance 2.1% below, despite economic cycle concerns. Notable performers include Powell, which reported a 49.8% year-over-year revenue growth, and OSI Systems, which saw a 16.8% year-over-year revenue increase, with their stocks rising 62.8% and 1.6%, respectively, since reporting.", "source": "https://finance.yahoo.com/news/q2-earnings-recap-powell-nasdaq-085455274.html", "timestamp": "2024-09-25T08:54:55", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 704, "created_at": "2024-09-26T04:24:55.285566+00:00", "title": "Fed Governor Adriana Kugler Supports Additional Interest Rate Cuts if Inflation Continues to Fall", "body": "Fed Governor Adriana Kugler strongly supports the 50-basis-point interest rate cut and is open to additional cuts if inflation continues to progress towards the 2% goal, citing a cooling job market and falling inflation. The Fed's new rate-cutting cycle aims to balance disinflation with avoiding unnecessary economic pain, with officials expecting two more 25-basis-point rate cuts this year.", "source": "https://finance.yahoo.com/news/feds-kugler-strongly-supported-bigger-rate-cut-sees-more-ahead-200202827.html", "timestamp": "2024-09-25T20:02:02", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Inflation", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 705, "created_at": "2024-09-26T04:25:08.706072+00:00", "title": "Oil prices steady as firmer fuel demand and falling inventories in US offset global demand concerns.", "body": "Oil prices were little changed on Thursday, with Brent crude futures up 0.08% to $73.52 per barrel and US West Texas Intermediate crude rising 0.03% to $69.71 per barrel, as signs of firmer fuel demand and falling inventories in the US outweighed concerns over global demand prospects. Despite a 2% slump on Wednesday, oil prices were supported by stronger demand in the US, with gasoline demand climbing to over 9 million barrels per day and distillate fuel supplied rising to over 4 million bpd.", "source": "https://finance.yahoo.com/news/oil-prices-little-changed-us-010438361.html", "timestamp": "2024-09-26T01:04:38", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Market Trends", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 706, "created_at": "2024-09-26T04:25:17.20538+00:00", "title": "Bitcoin's marketing evolution and tokenization of real-world assets are driving digital asset landscape transformation.", "body": "Bitcoin's early marketing struggles are being addressed by larger players driving broader adoption, while the concept of tokenizing real-world assets (RWAs) is gaining traction, with potential deals worth billions across multiple sectors, including real estate and fine art. The tokenization of RWAs is expected to become a common feature in financial markets, with rapid growth in secondary markets and broader adoption of blockchain technology across industries.", "source": "https://finance.yahoo.com/news/bitcoins-marketing-evolves-tokenized-assets-222252974.html", "timestamp": "2024-09-25T22:22:52", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["Blockchain", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 1, "sustainability": 0}, "votes": null}, {"id": 713, "created_at": "2024-09-26T04:40:39.812759+00:00", "title": "Lippo General Insurance Conducts 1:10 Stock Split, Leading to Significant Changes in Share Holdings among Major Investors.", "body": "Following PT Lippo General Insurance's 1:10 stock split, major investors reported significant changes in their shareholdings, with PT Hanwha Life Insurance Indonesia, PT Inti Anugerah Pratama, and Hanwha General Insurance Co. Ltd. increasing their stakes, while PT Goldman Investindo Sedaya and others reduced their holdings. The changes resulted in shifts in ownership percentages, with some investors increasing their control and others decreasing their stakes in various companies, including those in the food, finance, and manufacturing sectors.", "source": "https://www.idnfinancials.com/news/50985/investors-lippo-insurance-record-stock-result-stock-split", "timestamp": "2024-09-24T18:48:53", "sector": "financials", "sub_sector": ["insurance"], "tags": ["Stock Splits", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 2, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 722, "created_at": "2024-09-27T04:21:23.808081+00:00", "title": "Asian Shares Soar to 2-1/2-Year Highs on China's Stimulus Package and Falling Oil Prices", "body": "Chinese stocks are on track for their best week since 2008, with a 14% weekly gain, as Beijing rolls out a massive stimulus package to revive the economy, lifting Asian shares to 2-1/2-year highs. The stimulus has also boosted commodities, with iron ore and copper prices surging, while oil prices have fallen, boding well for global disinflation, and the US core personal consumption expenditures price index is expected to show a small monthly rise of 0.2%.", "source": "https://finance.yahoo.com/news/china-stocks-set-best-week-020959021.html", "timestamp": "2024-09-27T02:09:59", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Market Trends", "Metals and Minerals", "Economic Reports", "Inflation", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 723, "created_at": "2024-09-27T04:21:42.175387+00:00", "title": "Google Strengthens AI Presence with Gemini Platform, Sees 35-Fold Increase in Usage Across Various Enterprises", "body": "Google's AI presence is strengthening, with its Gemini platform seeing a 35-fold increase in usage, and its cloud segment revenue rising 28% year-over-year to $10 billion, driven by growing adoption of AI across enterprises and consumers. The company's Q2 financial report showed earnings per share of $1.89, beating forecasts, with revenue hitting $84.74 billion, up 14% year-over-year, driven primarily by its advertising segment, which accounted for 76% of total revenue.", "source": "https://finance.yahoo.com/news/analyst-alphabet-stock-price-target-003357288.html", "timestamp": "2024-09-27T00:33:57", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Artificial Intelligence", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 724, "created_at": "2024-09-27T04:21:54.931093+00:00", "title": "Oil prices drop over 2% as Saudi Arabia considers unwinding production cuts to regain market share.", "body": "Oil prices plummeted over 2% on Thursday after reports that Saudi Arabia plans to unwind voluntary production cuts starting December 1, which could lead to lower crude prices, with West Texas Intermediate falling below $68 per barrel and Brent dropping around $71 per barrel. Analysts have been lowering their price targets for Brent, predicting an average of $75 per barrel in the fourth quarter, citing growing supply and weak demand, with year-to-date declines of 3% for WTI and 4% for Brent.", "source": "https://finance.yahoo.com/news/oil-falls-more-than-2-on-report-saudi-arabia-vows-to-bring-barrels-back-even-if-prices-fall-161050446.html", "timestamp": "2024-09-26T16:10:50", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 737, "created_at": "2024-09-28T04:20:46.386981+00:00", "title": "Assets in actively managed exchange-traded funds worldwide reach record $1 trillion driven by regulatory changes and product innovation.", "body": "Assets in actively managed exchange-traded funds (ETFs) worldwide reached a record $1 trillion at the end of August, driven by easier regulations and product innovation, with active ETFs accounting for 30% of all inflows into funds over the past few years. The category has grown 10-fold since 2019, with assets surging 42% in August alone, and is expected to continue growing rapidly, with over 90% of ETF investors intending to increase their allocation to active ETFs.", "source": "https://finance.yahoo.com/news/assets-actively-managed-etfs-top-231719301.html", "timestamp": "2024-09-27T23:17:19", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Market Trends", "Fintech", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 738, "created_at": "2024-09-28T04:20:58.847113+00:00", "title": "Mark Spitznagel warns investors of potential stock market downturn despite recent record highs, citing overlooked lagging drivers and overconfidence in current market conditions.", "body": "Mark Spitznagel, a \"black swan\" investor, warns that the stock market's record highs are masking underlying risks, and investors should focus on lagging drivers that could trigger a sharp downturn, such as the recent uninversion of the yield curve, a reliable recession indicator. Spitznagel believes the market is in a \"goldilocks zone\" due to immediate positive catalysts like rate cuts and disinflation, but thinks investors should be more concerned about the economy's ability to withstand the effects of past rate hikes, which could lead to a market crash.", "source": "https://finance.yahoo.com/news/stock-markets-euphoria-driven-record-025213771.html", "timestamp": "2024-09-28T02:52:13", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Interest Rates", "Recession", "Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 1, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 739, "created_at": "2024-09-28T04:21:23.323624+00:00", "title": "Shelf-Stable Food Stocks Report Mixed Q2 Earnings Amid Shift to Health-Conscious Options", "body": "Shelf-stable food stocks reported mixed Q2 earnings, with revenues missing analysts' consensus estimates by 0.7%, but the group's share prices have been resilient, up 7.9% on average since the latest earnings results. Notable performers include Utz Brands, which reported strong revenue and operating margin growth, and Bellring Brands, which outperformed analysts' expectations with a 15.6% year-over-year revenue increase, while Lamb Weston and Hershey's reported disappointing results.", "source": "https://finance.yahoo.com/news/reflecting-shelf-stable-food-stocks-085939294.html", "timestamp": "2024-09-27T08:59:39", "sector": "consumer-non-cyclicals", "sub_sector": ["food-staples-retailing"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "IDX", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 740, "created_at": "2024-09-28T04:21:50.385982+00:00", "title": "Qualcomm, Nvidia, and Other Processors and Graphics Chips Stocks Report Mixed Q2 Earnings", "body": "Qualcomm, Nvidia, and Broadcom reported strong quarterly earnings, with revenue growth of 11.1%, 122%, and 47.3% year-over-year, respectively, beating analysts' expectations, while Lattice Semiconductor and Qorvo reported disappointing results, with revenue declines of 34.7% and 36.2% year-over-year, respectively. Despite the mixed results, the average share price of the 9 processors and graphics chips stocks tracked has declined by 1.3% since the latest earnings results.", "source": "https://finance.yahoo.com/news/q2-earnings-highlights-qualcomm-nasdaq-085932967.html", "timestamp": "2024-09-27T08:59:32", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 741, "created_at": "2024-09-28T04:21:55.845973+00:00", "title": "Advances in Artificial Intelligence Could Trigger Unwelcome Outcomes in Financial Markets", "body": "Advances in artificial intelligence (AI) could lead to overcrowded trades, where similar investment strategies fueled by complex trading models drive investors into the same stocks, posing risks such as liquidity shortages, volatility spikes, and short squeezes. Tradeweb Markets CEO Billy Hult warns that AI-driven markets may worsen crowding into top-performing stocks, but also envisions a future where traders are better informed through deeper insights gathered from various sources, leading to more sophisticated trading models.", "source": "https://finance.yahoo.com/news/crowded-trades-may-be-the-unintended-consequence-of-ai-in-market-tradeweb-ceo-124919487.html", "timestamp": "2024-09-27T12:49:19", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Artificial Intelligence", "Market Trends", "Market Sentiment", "Short Selling", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 2, "management": 1, "sustainability": 0}, "votes": null}, {"id": 742, "created_at": "2024-09-28T04:22:11.126225+00:00", "title": "Bain & Company forecasts AI-related hardware and software market to grow 40-55% annually, reaching $780 billion to $990 billion by 2027.", "body": "Bain & Company forecasts the AI-related hardware and software market to grow 40%-55% annually, reaching $780 billion-$990 billion by 2027, driven by increased spending from companies of all sizes, with large enterprises doubling their AI spend to over $100 million annually. Despite skepticism and volatility in AI stocks, most investors remain bullish on the theme, with some experts warning of potential speed bumps ahead, including slowing software revenue growth and semiconductor shortages.", "source": "https://finance.yahoo.com/news/a-big-ai-prediction-re-juices-the-trade-morning-brief-095550869.html", "timestamp": "2024-09-27T09:55:50", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Artificial Intelligence", "Bullish", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 754, "created_at": "2024-09-29T04:24:49.767074+00:00", "title": "Apparel, Accessories, and Luxury Goods Stocks Report Mixed Q2 Earnings Amid Shifting Consumer Trends", "body": "In the apparel, accessories, and luxury goods industry, 17 companies reported slower Q2 revenues, missing analysts' consensus estimates by 1.3%, with next quarter's revenue guidance 12.6% below expectations. However, Guess, Figs, and Oxford Industries were among the top performers, with Guess achieving the fastest revenue growth at 10.2% year-over-year, while Figs and Oxford Industries saw their stocks rise 18% and 1.3%, respectively, since reporting.", "source": "https://finance.yahoo.com/news/q2-apparel-accessories-luxury-goods-085253624.html", "timestamp": "2024-09-27T08:52:53", "sector": "consumer-cyclicals", "sub_sector": ["apparel-luxury-goods"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 755, "created_at": "2024-09-30T04:26:38.394962+00:00", "title": "BYD Recalls Nearly 97,000 Electric Vehicles in China Due to Manufacturing Fault Causing Fire Risks", "body": "BYD is recalling nearly 97,000 electric vehicles in China due to a manufacturing fault that could lead to fire risks, affecting its top-selling Dolphin and Yuan Plus models that accounted for 26% of its 3 million cars sold in 2023. The recall is a rare move for BYD, which has grown rapidly to become the world's biggest seller of pure electric and plug-in hybrid cars.", "source": "https://finance.yahoo.com/news/byd-recalling-97-000-top-031358396.html", "timestamp": "2024-09-30T03:13:58", "sector": "consumer-cyclicals", "sub_sector": ["automobiles-components"], "tags": ["Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 756, "created_at": "2024-09-30T04:26:49.554737+00:00", "title": "Singapore's stagnant IPO market expected to get boost from real estate investment trusts next year.", "body": "Singapore's stagnant initial public offering (IPO) market is expected to receive a boost next year from real estate investment trusts (REITs), with Japan's Nippon Telegraph & Telephone Corp. considering a $1 billion data-center REIT listing, which could spark a virtuous cycle of new listings. The sector has seen a 14% rise in the third quarter, making it more attractive to investors, and lower interest rates could further boost REITs' borrowing costs and dividend attractiveness, leading to a potential revival of the IPO market.", "source": "https://finance.yahoo.com/news/singapore-moribund-ipo-market-looks-002325793.html", "timestamp": "2024-09-30T00:23:25", "sector": "properties-real-estate", "sub_sector": ["properties-real-estate"], "tags": ["IPO", "Interest Rates", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 757, "created_at": "2024-09-30T04:27:07.39892+00:00", "title": "US Stocks Expected to Outperform Government Bonds as Federal Reserve Cuts Interest Rates", "body": "According to a Bloomberg Markets Live Pulse survey, 60% of respondents expect US equities to deliver the best returns in the fourth quarter, with 59% preferring emerging markets over developed ones, as investors become more risk-on and bullish on stocks. The Federal Reserve's interest rate cuts have boosted investor confidence, with 59% expecting quarter-point cuts at the next two meetings, and the S&P 500 index is on track to gain in September, historically its worst month.", "source": "https://finance.yahoo.com/news/stocks-bonds-top-trades-rest-190000400.html", "timestamp": "2024-09-29T19:00:00", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Sentiment", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 759, "created_at": "2024-09-30T04:27:58.376399+00:00", "title": "Real Estate Debt Emerges as Top-Performing Asset Class Amid Central Banks' Rate Cuts", "body": "The riskiest slice of real estate company debt has returned over 75% this year, with top 10 performers, known as subordinated bonds, returning around 170%, beating Nvidia Corp.'s stock. This swift turnaround is attributed to major central banks cutting borrowing costs, allowing landlords to refinance old bonds and issue new debt, making real estate debt an early winner in the current market.", "source": "https://finance.yahoo.com/news/riskiest-real-estate-bonds-beating-190000546.html", "timestamp": "2024-09-28T19:00:00", "sector": "properties-real-estate", "sub_sector": ["properties-real-estate"], "tags": ["Interest Rates", "Debt", "Bonds", "Inflation", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 760, "created_at": "2024-09-30T04:28:08.675416+00:00", "title": "Oil prices rise on concerns over potential Middle East supply pressures and escalating conflict between Israel and Iran.", "body": "Oil prices rose on Monday, with Brent crude futures increasing 0.71% to $72.49 a barrel and US West Texas Intermediate crude futures adding 0.63% to $68.61 a barrel, driven by concerns over potential supply pressures from Middle East producers. Despite last week's decline, prices were supported by the possibility of a widening Middle East conflict, with analysts warning that supply-demand dynamics and upcoming OPEC+ supply cuts could drive prices lower, potentially testing 2021 lows.", "source": "https://finance.yahoo.com/news/oil-prices-rise-middle-east-005526571.html", "timestamp": "2024-09-30T00:55:26", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 764, "created_at": "2024-09-30T04:32:25.761961+00:00", "title": "Financial Services Authority Revokes License of Allianz Life Indonesia's Sharia Unit Ahead of Transfer to New Entity.", "body": "The Financial Services Authority (OJK) has revoked the license of PT Asuransi Allianz Life Indonesia's sharia unit, which will be transferred to PT Asuransi Allianz Life Syariah Indonesia, prohibiting AALI from conducting life insurance activities based on sharia principles. As of July 2024, the sharia unit reported investment income of IDR 541.35 million and a profit after taxes of IDR 478 million.", "source": "https://www.idnfinancials.com/news/51009/successful-spin-off-ojk-revokes-allianzs-sharia-unit-license", "timestamp": "2024-09-26T15:28:42", "sector": "financials", "sub_sector": ["insurance"], "tags": ["Sharia Economy", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 770, "created_at": "2024-10-01T04:26:29.310001+00:00", "title": "Bursa Malaysia considers introducing framework to improve valuations of local companies to attract global investors.", "body": "Bursa Malaysia, the country's stock exchange, is considering a \"formalized framework\" to improve valuations of local companies by setting targets for metrics such as price-to-earnings ratio and return on equity, aiming to attract more global investors. The exchange has seen a 66.8% increase in average daily trading value in the first half of the year, and is targeting 50 initial public offerings by 2025, with a \"healthy pipeline\" of listings, including a potential IPO of Sunway Group's healthcare unit that could raise up to 3.5 billion ringgit.", "source": "https://finance.yahoo.com/news/malaysian-bourse-eyes-value-boosting-230000115.html", "timestamp": "2024-09-30T23:00:00", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["IPO", "Market Trends", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 767, "created_at": "2024-10-01T04:25:49.728733+00:00", "title": "Louis Dreyfus Co. Raises Offer for Namoi Cotton Ltd. After Acquiring Nearly Half of Australian Company's Shares.", "body": "Louis Dreyfus Co. has raised its offer to acquire Namoi Cotton Ltd. to $0.77 per share, valuing the company at $158 million, after acquiring nearly half of Namoi's shares and outbidding Olam Agri Holdings Ltd. The increased offer has set Dreyfus up to close the deal, making Olam's takeover bid substantially less likely, with Namoi's shares rising 8.8% to $0.7725 and rallying 61% this year.", "source": "https://finance.yahoo.com/news/dreyfus-buys-nearly-half-cotton-025612544.html", "timestamp": "2024-10-01T02:56:12", "sector": "consumer-non-cyclicals", "sub_sector": ["food-beverage"], "tags": ["Mergers & Acquisitions", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 2, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 768, "created_at": "2024-10-01T04:26:22.279537+00:00", "title": "Asian shares mixed as Japanese indexes rise on weaker yen, US equity futures swing between gains and losses.", "body": "Asian shares had a mixed start to the fourth quarter, with Japan's Nikkei 225 index rising 1.9% after a 5% slump the previous day, while Taiwan shares gained and Australian shares slipped, as the yen weakened slightly against the dollar. The US equity futures were little changed, with the S&P 500 securing its fourth consecutive quarter of advances, and the MSCI China index outperforming the emerging-market gauge by almost 22 percentage points in September.", "source": "https://finance.yahoo.com/news/japan-stocks-set-regain-ground-224929972.html", "timestamp": "2024-10-01T02:34:25", "sector": "consumer-cyclicals", "sub_sector": ["retailing"], "tags": ["Market Trends", "Market Sentiment", "Interest Rates", "Economic Reports", "Retail Sales", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 1, "sustainability": 0}, "votes": null}, {"id": 769, "created_at": "2024-10-01T04:26:24.550745+00:00", "title": "Asia's factory activity slows in September amid soft Chinese demand and global economic uncertainty.", "body": "Asia's factory activity weakened in September, with China's manufacturing PMI dropping to 49.3, its lowest reading since July last year, while Japan's PMI dipped to 49.7, remaining below the 50.0 threshold for the third straight month. The region's export growth is decelerating, with South Korea's shipments barely increasing, and manufacturing activity shrinking in Vietnam, Malaysia, and Indonesia, highlighting the challenging outlook for Asian economies.", "source": "https://finance.yahoo.com/news/asias-factory-activity-hit-global-021539424.html", "timestamp": "2024-10-01T02:15:39", "sector": "industrials", "sub_sector": ["industrial-services"], "tags": ["Inflation", "Market Trends", "Market Sentiment", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 771, "created_at": "2024-10-01T04:26:42.589535+00:00", "title": "Federal Reserve Chair Jerome Powell signals no rush to cut interest rates, but will act if economy slows.", "body": "Federal Reserve Chair Jerome Powell indicated that the central bank is in no rush to cut interest rates quickly, but will do what it takes to keep the economy in solid shape, with two more 25-basis-point rate cuts predicted in 2024. Powell emphasized that the Fed's goal is to maintain a strong job market and achieve 2% inflation, and that further rate cuts will depend on upcoming economic data, including the jobs report due out on Friday.", "source": "https://finance.yahoo.com/news/powell-fed-will-do-what-it-takes-to-keep-economy-in-solid-shape-175504188.html", "timestamp": "2024-09-30T20:17:37", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Inflation", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 772, "created_at": "2024-10-01T04:26:54.494096+00:00", "title": "Oil prices steady as stronger supply prospects and tepid demand growth offset Middle East tensions.", "body": "Oil prices remained steady on Tuesday, with Brent crude futures up 0.1% to $71.77 a barrel and US West Texas Intermediate crude futures up 0.12% to $68.25, as stronger supply prospects and tepid global demand growth offset concerns over Middle East tensions. Despite a 9% monthly drop in Brent futures, the largest since November 2022, and a 16% quarterly loss, market participants are stabilizing hopes that recent stimulus measures may help jumpstart the economy ahead.", "source": "https://finance.yahoo.com/news/oil-steady-prospect-more-supply-005707180.html", "timestamp": "2024-10-01T00:57:07", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 784, "created_at": "2024-10-01T08:24:40.602024+00:00", "title": "General Insurance Records an 18.4% Premium Increase", "body": "The Indonesian General Insurance Association (AAUI) reported an 18.4% increase in premium income in the first half of 2024, driven primarily by the aviation and credit insurance sectors. \n\nAccording to AAUI data, the general insurance industry recorded premiums amounting to IDR 57.91 trillion. In the same period last year, general insurance premiums were recorded at IDR 48.9 trillion.", "source": "https://www.cnbcindonesia.com/market/20240930164923-17-575788/asuransi-umum-catat-kenaikan-premi-184-sektor-ini-penyumbang-utama", "timestamp": "2024-10-01T07:59:00", "sector": "financials", "sub_sector": ["insurance"], "tags": ["Market Trends", "Economic Reports", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 1}, "votes": [668]}, {"id": 786, "created_at": "2024-10-03T04:20:38.89643+00:00", "title": "Chinese Stocks Fall as Investors Take Profits Amid Economic Stimulus Uncertainty", "body": "Hong Kong-listed Chinese companies' shares dropped 4.9%, halting a 13-day rally, as the Hang Seng Index sank 4.5%, its biggest intraday drop in almost two years, amid investor caution over the effectiveness of Beijing's stimulus measures. Meanwhile, Japanese stocks advanced, with the Topix Index rising over 1%, as the yen fell to a one-month low against the dollar, and US stock futures fell ahead of Friday's nonfarm payroll data.", "source": "https://finance.yahoo.com/news/japan-stocks-poised-rebound-yen-223635526.html", "timestamp": "2024-10-03T02:34:13", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 788, "created_at": "2024-10-03T04:21:02.462546+00:00", "title": "Mixed Q2 Earnings for Gas and Liquid Handling Stocks Amid Economic Uncertainty", "body": "Among 12 gas liquid handling stocks tracked, revenues missed analysts' consensus estimates by 0.9%, with mixed Q2 results; however, share prices have held steady, up 1.3% on average since the latest earnings results. Notable performers include Flowserve, which reported a 7.1% year-over-year revenue increase and outperformed analysts' expectations, while underperformers like Chart Industries saw a 22.2% stock decline since reporting.", "source": "https://finance.yahoo.com/news/q2-earnings-outperformers-donaldson-nyse-093447718.html", "timestamp": "2024-10-02T09:34:47", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Energy Commodities", "Mixed."], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 789, "created_at": "2024-10-03T04:21:11.135342+00:00", "title": "Tesla's third-quarter deliveries miss expectations, sending stock down 3%.", "body": "Tesla's third-quarter deliveries of 462,890 vehicles, up 6.4% quarter-over-quarter, slightly missed Wall Street's expectations of 463,897, causing a 3% stock drop. Despite this, the company's delivery numbers still represented a 6.4% growth quarter-over-quarter and a year-over-year increase, with Model 3 and Model Y accounting for the bulk of the deliveries.", "source": "https://finance.yahoo.com/news/tesla-stock-drops-3-after-q3-deliveries-fall-short-of-estimates-202245253.html", "timestamp": "2024-10-02T20:22:45", "sector": "consumer-cyclicals", "sub_sector": ["automobiles-components"], "tags": ["Earnings Report", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 790, "created_at": "2024-10-03T04:21:37.891312+00:00", "title": "PayPal CEO Alex Chriss outlines vision for company's next decade beyond payments", "body": "PayPal's CEO Alex Chriss is shifting the company's focus beyond payments to commerce, aiming to connect consumers and merchants, and has made significant progress in his first year, including overhauling the leadership team and cutting projects to focus on bigger bets. Despite a 23% decline in shares over the past five years, PayPal's market cap stands at $79.2 billion, with a forward price-to-earnings multiple of 16 times, as investors wait for sustainable and stronger results.", "source": "https://finance.yahoo.com/news/how-paypals-new-ceo-is-reinventing-the-firm-as-it-goes-beyond-payments-141126940.html", "timestamp": "2024-10-02T14:11:26", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["Executive Changes", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 2, "sustainability": 0}, "votes": null}, {"id": 801, "created_at": "2024-10-03T04:42:09.946669+00:00", "title": "Pertamina Geothermal Energy signs MOU with Genvia to develop clean hydrogen technology.", "body": "PT Pertamina Geothermal Energi (PGeo) has signed a memorandum of understanding with Genvia, a French clean hydrogen technology company, to jointly research and develop low-carbon hydrogen using geothermal energy, aiming to create an economic model for a competitive green hydrogen business. This partnership is expected to strengthen cross-border collaboration and advance the development and adoption of green energy, with PGeo and Genvia working together to enter the global green energy market.", "source": "https://www.idnfinancials.com/news/51037/accelerating-green-hydrogen-innovation-pgeo-pertamina-nre-genvia", "timestamp": "2024-10-01T09:42:26", "sector": "energy", "sub_sector": ["alternative-energy"], "tags": ["Clean Energy", "Energy Commodities", "Market Trends", "Foreign Investor", "ESG", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 2}, "votes": null}, {"id": 812, "created_at": "2024-10-04T04:20:57.587277+00:00", "title": "Asian Stocks Fall, Oil Prices Surge Amid Escalating Middle East Tensions", "body": "Oil prices surged to their largest weekly gain in over a year, with Brent crude futures rising 7.8% and US West Texas Intermediate crude futures advancing 8.1%, as escalating tensions in the Middle East sparked concerns over supply disruptions. Meanwhile, Asian stocks retreated, with the MSCI's broadest index of Asia-Pacific shares outside Japan falling 0.32%, and the US dollar held near a six-week high against a basket of currencies ahead of the US jobs report.", "source": "https://finance.yahoo.com/news/asia-shares-fall-oil-set-021204645.html", "timestamp": "2024-10-04T02:12:04", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Market Trends", "Energy Commodities", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 814, "created_at": "2024-10-04T04:21:35.597336+00:00", "title": "Online Marketplace Stocks Report Strong Q2 Earnings with Revenue Beats and Guidance", "body": "Sixteen online marketplace stocks reported satisfactory Q2 earnings, with revenues beating analysts' consensus estimates by 4.9% and next quarter's revenue guidance 5.1% above expectations, led by strong performances from Remitly, Everquote, and Robinhood, which saw revenue growth of 30.9%, 72.3%, and 40.3%, respectively. Despite some mixed results, the group's share prices have held steady, with an average increase of 4.4% since reporting, as investors remain optimistic about the sector's growth prospects.", "source": "https://finance.yahoo.com/news/q2-earnings-outperformers-remitly-nasdaq-092513836.html", "timestamp": "2024-10-03T09:25:13", "sector": "technology", "sub_sector": ["software-it-services"], "tags": ["Earnings Report", "Market Sentiment", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 815, "created_at": "2024-10-04T04:21:46.600796+00:00", "title": "Rising Oil Prices and Geopolitical Tensions Cast Shadow Over Asian Markets Ahead of Key Economic Data Releases", "body": "Brent crude oil prices surged over 5% on Thursday, bringing weekly gains to over 8%, sparking fears of deepening conflict in the Middle East and casting a dark shadow over global markets. The rising oil prices, combined with increasing US Treasury yields and a strengthening US dollar, may lead to a cautious tone in Asian markets on Friday, ahead of key economic releases, including US non-farm payrolls data.", "source": "https://finance.yahoo.com/news/morning-bid-oils-shadow-over-215030950.html", "timestamp": "2024-10-03T21:50:30", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Interest Rates", "Market Trends", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 832, "created_at": "2024-10-05T04:19:13.63919+00:00", "title": "Federal Reserve's Monetary Easing Campaign May Be Over Amid Strong Labor Report and Rising Inflation Concerns", "body": "The strong labor report has led Wall Street veteran Ed Yardeni to suggest that the Federal Reserve's monetary-easing campaign for 2024 may already be over, as further policy easing could spark inflation and fuel investor euphoria. The Fed's September decision to lower rates by half a percentage point was deemed \"not necessary\" by Yardeni, who warns that additional easing could set the stage for a painful market event, similar to the 1990s-style meltup scenario.", "source": "https://finance.yahoo.com/news/ed-yardeni-sees-fed-pausing-215648825.html", "timestamp": "2024-10-04T21:56:48", "sector": "financials", "sub_sector": ["banks"], "tags": ["Inflation", "Interest Rates", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 833, "created_at": "2024-10-05T04:19:28.715589+00:00", "title": "Eli Lilly Increases Production of Weight-Loss Drug Mounjaro, Ending Supply Shortage", "body": "Eli Lilly's production increase of its weight-loss drug Zepbound and type 2 diabetes drug Mounjaro has enabled the company to meet current demand, giving it an edge over competitor Novo Nordisk, which still faces dose shortages. As a result, Lilly's market share in the weight loss category has increased, with Zepbound's sales rising 1.1% to 43.4% of total prescriptions filled, while Novo's Wegovy has lost 1.2% market share, down to 55.7% of total prescriptions.", "source": "https://finance.yahoo.com/news/what-end-of-eli-lillys-weight-loss-drug-shortage-means-for-the-competition-160712667.html", "timestamp": "2024-10-04T16:07:12", "sector": "healthcare", "sub_sector": ["pharmaceuticals-health-care-research"], "tags": ["Earnings Report", "Product Launch", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 842, "created_at": "2024-10-05T04:30:17.074307+00:00", "title": "Broom, a digital automotive startup, raises $25 million in Series A+ funding to digitalize Indonesia's traditional automotive sector.", "body": "Broom, a digital automotive startup, has concluded a Series A+ funding round worth $25 million led by Openspace, which will be used to digitalize the traditional automotive sector by providing financing solutions to dealers. With this funding, Broom plans to expedite market expansion, form strategic partnerships, and ensure sustainable growth, building on its notable business growth, including a 144.9% increase in fund allocation and $17 million in revenue from its leasing channel.", "source": "https://www.idnfinancials.com/news/51059/automotive-startup-broom-secures-series-a-funding", "timestamp": "2024-10-02T18:34:00", "sector": "financials", "sub_sector": ["financing-service", "automobiles-components"], "tags": ["Fintech", "Financial Ratios", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 844, "created_at": "2024-10-06T04:23:03.146271+00:00", "title": "Foreign Exchange Market Remains Quiet Despite Global Geopolitical and Economic Shifts", "body": "The foreign exchange market has remained quiet despite global geopolitical and economic shifts, with realized volatility in most currency pairings at an incredibly low level, but a potential yen carry trade unwind could shake up the market. A strengthening yen could impact Japanese pension funds' foreign investments, with a significant move in the dollar potentially unraveling deeper positions, and options trades are becoming busier as investors seek to hedge against potential volatility.", "source": "https://finance.yahoo.com/news/forex-markets-await-political-shocks-183302771.html", "timestamp": "2024-10-05T18:33:00", "sector": "", "sub_sector": [], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Foreign Investor", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 846, "created_at": "2024-10-06T04:23:38.205185+00:00", "title": "Oil prices surge to biggest weekly gain in over a year amid Middle East tensions.", "body": "Oil futures rose 9% this week, the biggest weekly gain in over a year, with West Texas Intermediate settling at $74.38 per barrel and Brent at $78.09 per barrel, driven by concerns over potential disruptions to oil supplies in the Middle East. Despite the gains, analysts believe that spare capacity from OPEC+ could keep prices relatively contained, and that the White House is unlikely to support targeting Iranian oil facilities, which could lead to higher oil prices.", "source": "https://finance.yahoo.com/news/oil-pares-gains-as-biden-aims-to-discourage-israel-from-targeting-iran-crude-facilities-191038791.html", "timestamp": "2024-10-04T19:10:38", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 847, "created_at": "2024-10-06T04:23:50.964053+00:00", "title": "Foxconn's Revenue Growth Accelerates on Strong AI Server Demand, Beats Analyst Projections", "body": "Hon Hai Precision Industry Co., also known as Foxconn, reported a 20.2% year-over-year revenue growth to NT $1.85 trillion in the third quarter, exceeding analyst projections and driven by growing demand for servers containing NVIDIA's AI chips. The company's shares have risen over 85% in 2024, and its sales growth is expected to accelerate in 2024-25 as AI emerges as a key growth engine, with potential upside from new GPU models and stabilizing smartphone demand.", "source": "https://finance.yahoo.com/news/iphone-maker-hon-hai-sustains-083305154.html", "timestamp": "2024-10-05T08:33:05", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Artificial Intelligence", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 849, "created_at": "2024-10-06T04:32:12.751596+00:00", "title": "Merdeka Gold's Revenue Soars 110% in First Half of 2024, Turning a Profit.", "body": "PT Merdeka Gold Copper's revenue soared 110.19% year-on-year to USD 1.09 billion in H1 2024, driven by strong domestic and export sales, with significant contributions from key customers. The company's gross profit grew 9.23% to USD 88.70 billion, operating profit jumped 23.71% to USD 62.17 billion, and net profit reached USD 20.53 million, a significant turnaround from a loss of USD 54.91 million in H1 2023.", "source": "https://www.idnfinancials.com/news/51079/in-mdka-surge-revenue", "timestamp": "2024-10-04T13:06:28", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Earnings Report", "Metals and Minerals", "Gold", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 811, "created_at": "2024-10-04T04:20:39.645352+00:00", "title": "Asian Shipping Stocks Plummet as US East Coast Port Strike Ends Sooner than Expected", "body": "Shares of Asian shipping companies, including Evergreen Marine, Wan Hai Lines, and Yang Ming Marine, plummeted by 8.8-10% on Friday after a surprise deal ended a strike at East Gulf Coast docks, dashing hopes of a short-term rebound in freight charges. Japanese shippers Nippon Yusen, Kawasaki Kisen, and Mitsui OSK Lines also fell by 7-9%, making them the largest decliners on the Topix index.", "source": "https://finance.yahoo.com/news/shipping-stocks-slide-us-port-023033797.html", "timestamp": "2024-10-04T02:30:00", "sector": "transportation-logistic", "sub_sector": ["logistics-deliveries"], "tags": ["Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 855, "created_at": "2024-10-07T04:28:46.953427+00:00", "title": "Global Fund Managers Remain Skeptical of China's Stock Market Rally", "body": "Global fund managers and strategists are skeptical about the recent rally in Chinese stocks, citing concerns that many stocks are already overvalued and that Beijing's stimulus measures may not be enough to sustain the rally. Despite the Hang Seng China Enterprises Index surging over 35% in the past month, investors are cautious due to uncertainty over the durability of the rebound and the need for further policy steps to boost economic activity and confidence.", "source": "https://finance.yahoo.com/news/china-stock-skepticism-gets-louder-120000886.html", "timestamp": "2024-10-07T03:03:25", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Market Sentiment", "Valuation", "Market Analysis", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 856, "created_at": "2024-10-07T04:28:53.104858+00:00", "title": "China's central bank holds back on gold purchases for fifth straight month as prices surge.", "body": "China's gold reserves remained unchanged at 72.8 million troy ounces in September, but the value of its gold reserves increased to $191.47 billion from $182.98 billion in August, driven by a 28% surge in gold prices this year. The People's Bank of China has paused its gold purchases for five consecutive months, awaiting a more attractive entry point, despite being the world's largest official sector buyer of gold in 2023.", "source": "https://finance.yahoo.com/news/chinas-gold-reserves-unchanged-fifth-023509565.html", "timestamp": "2024-10-07T02:35:09", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Gold", "Metals and Minerals", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 857, "created_at": "2024-10-07T04:29:05.937513+00:00", "title": "Asian Stocks Rally and Dollar Hits Seven-Week High After Strong US Labour Data", "body": "Asian stocks rallied, with Japan's Nikkei leading the gains, as the US labor data dispelled recession fears, causing the dollar to reach a fresh seven-week peak against the yen and short-term US Treasury yields to rise. The market now expects a quarter-point rate cut at the Federal Reserve's next policy announcement, with traders pricing in a 95% chance, and crude oil prices eased from a one-month peak despite rising tensions in the Middle East.", "source": "https://finance.yahoo.com/news/japan-leads-asia-stock-rally-005028250.html", "timestamp": "2024-10-07T01:57:43", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Recession", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 858, "created_at": "2024-10-07T04:29:19.022127+00:00", "title": "US Employment Figures Surprise, Shifting Global Market Landscape and Boosting Investor Confidence", "body": "The strong US employment figures released on Friday have led to a significant shift in US rate futures markets, with a 50 basis point rate cut now off the table and the implied pricing aligned with Fed Chair Jerome Powell's baseline case of a quarter-point cut at each of the next two meetings, pointing to a higher projected \"terminal\" rate of 3.25% in 2026. The US dollar, bond yields, and stocks surged higher on Friday, with the dollar index rising over 2% in its best week in over two years, and Brent crude oil futures rising 9% in their best week since January 2023.", "source": "https://finance.yahoo.com/news/morning-bid-markets-mull-potential-214746022.html", "timestamp": "2024-10-06T21:47:46", "sector": "financials", "sub_sector": ["banks"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Bonds", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 859, "created_at": "2024-10-07T04:29:59.878279+00:00", "title": "Global Commodity Markets Surge Amid Middle East Conflict, Supply Chain Disruptions, and Weather Events", "body": "The Bloomberg Commodity Spot Index has rebounded to highs last seen in late May, driven by gold's rally and repeated records, as well as rebounds in natural gas and copper, with gold accounting for 17% of the index. Meanwhile, commodity prices are soaring due to escalating conflict in the Middle East, war in Ukraine, and supply chain bottlenecks, with gold making oil cheaper, corn prices in Brazil hovering at highs, and aluminum market contracts trading at a higher premium.", "source": "https://finance.yahoo.com/news/five-key-charts-watch-global-210000410.html", "timestamp": "2024-10-06T21:00:00", "sector": "basic-materials", "sub_sector": ["basic-materials"], "tags": ["Energy Commodities", "Gold", "Grains", "Metals and Minerals", "Market Trends", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 860, "created_at": "2024-10-07T04:30:02.91651+00:00", "title": "Vernova's stock surges as big tech's AI infrastructure buildout drives demand for power equipment.", "body": "Vernova, a power equipment maker, has seen its shares hover near all-time highs, driven by expectations of power demand growth from big tech's commitment to record infrastructure technology investments, with analysts predicting the company's revenue to grow substantially. With a price target of $230-$397, Vernova is seen as a winner in the electrification and AI theme, with its global reach and diversified product offerings making it a \"supermarket\" for the electric power industry.", "source": "https://finance.yahoo.com/news/a-ge-spinoffs-stock-is-surging-as-it-positions-itself-as-the-supermarket-for-ai-energy-demand-140019819.html", "timestamp": "2024-10-06T14:00:19", "sector": "energy", "sub_sector": ["alternative-energy"], "tags": ["Market Trends", "Market Sentiment", "Artificial Intelligence", "Earnings Report", "Valuation", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 861, "created_at": "2024-10-07T04:30:05.377688+00:00", "title": "Oil prices retreat from weekly highs amid Middle East tensions, but geopolitical concerns continue to exert upward pressure.", "body": "Oil prices retreated on Monday, with Brent crude futures falling 0.5% to $77.62 per barrel and US West Texas Intermediate crude futures slipping 0.5% to $74.03 per barrel, after posting their biggest weekly rise in over a year last week. Despite the retreat, analysts expect the oil market to continue facing upside pressure due to geopolitical tensions, with Brent crude gaining 8% and WTI gaining 9.1% on a weekly basis last week.", "source": "https://finance.yahoo.com/news/oil-pares-gains-strongest-weekly-004038788.html", "timestamp": "2024-10-07T00:40:38", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 866, "created_at": "2024-10-08T04:24:03.84184+00:00", "title": "China's Equity Rally Loses Momentum as Key Briefing on Economic Stimulus Measures Underwhelms Investors", "body": "China's equity rally lost momentum after a key briefing failed to deliver expected economic stimulus measures, causing Hong Kong shares to plunge and the CSI 300 index to pare its 11% gain to 2% within an hour of trading. The broader Asian equities market also dropped, with MSCI's Asia-Pacific share gauge experiencing its largest decline in a month, as investors were left disappointed by the lack of new stimulus measures and geopolitical tensions continued to weigh on markets.", "source": "https://finance.yahoo.com/news/asian-traders-cautious-ahead-china-223430584.html", "timestamp": "2024-10-08T02:57:44", "sector": "financials", "sub_sector": ["banks"], "tags": ["Market Trends", "Market Sentiment", "Interest Rates", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 867, "created_at": "2024-10-08T04:24:22.928278+00:00", "title": "China Confident in Meeting Economic Targets, Promises Further Support for Growth", "body": "China's economic planning agency expressed confidence in meeting its economic targets this year, promising further support for growth through measures such as speeding up spending and issuing ultra-long sovereign bonds, but held back on unleashing more major stimulus, disappointing investors. The government's plans include bringing forward 100 billion yuan investment in key strategic areas and introducing specific measures to expand areas allowed to receive funding support from special local government bonds, aiming to stabilize growth and boost confidence.", "source": "https://finance.yahoo.com/news/china-vows-hit-economic-goals-025337318.html", "timestamp": "2024-10-08T02:53:37", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Economic Reports", "Market Trends", "Interest Rates", "Bonds", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 868, "created_at": "2024-10-08T04:24:39.913787+00:00", "title": "Chinese Stocks Soar to Multi-Year Highs on Stimulus Optimism, While Other Asian Markets Slip", "body": "China's CSI300 blue-chip index surged 10% to its highest level since July 2022, while the Shanghai Composite Index jumped roughly the same amount to its highest mark since December 2021, driven by investor optimism over Beijing's aggressive stimulus measures. Meanwhile, other Asian markets, including Hong Kong and Tokyo, fell, with the MSCI's broadest index of Asia-Pacific shares outside Japan down more than 1%, as investors reassessed the outlook for the Fed's easing cycle and worried about the impact of a potential Middle East conflict on oil supplies.", "source": "https://finance.yahoo.com/news/middle-east-conflict-keeps-markets-004300395.html", "timestamp": "2024-10-08T02:47:34", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Market Trends", "Market Sentiment", "Interest Rates", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 870, "created_at": "2024-10-08T04:25:22.64439+00:00", "title": "Electrical Systems Stocks Report Mixed Q2 Earnings Amid Economic Uncertainty", "body": "Among 15 electrical systems stocks, Q2 revenues beat analysts' consensus estimates by 1.8%, but next quarter's revenue guidance was 2.1% below, with companies like Napco, Powell, and Kimball Electronics reporting mixed results. Despite this, electrical systems stocks have been resilient, with average share prices up 5.1% since latest earnings results, and some companies like Powell seeing significant growth, with its stock up 81.9% since reporting.", "source": "https://finance.yahoo.com/news/q2-earnings-roundup-napco-nasdaq-081850181.html", "timestamp": "2024-10-07T08:18:50", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 871, "created_at": "2024-10-08T04:25:31.299542+00:00", "title": "Oil prices dip in Asian trading as traders take profits after recent rally amid Middle East tensions.", "body": "Oil prices fell 0.3% on Tuesday, with Brent crude futures at $80.70 per barrel and US West Texas Intermediate futures at $76.94 per barrel, after a 3% rise on Monday to their highest levels since late August. Despite the rally, analysts believe that oil prices may face downward pressure if Israel targets non-oil facilities in Iran, and spare supply capacity within OPEC could make up for any loss in Iranian oil output.", "source": "https://finance.yahoo.com/news/oil-edges-lower-rallying-highest-010302943.html", "timestamp": "2024-10-08T01:03:02", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 0, "management": 0, "sustainability": 0}, "votes": null}, {"id": 872, "created_at": "2024-10-08T04:26:03.627571+00:00", "title": "Federal Judge Rules Google Must Allow Rival App Stores and Billing Systems on Android Devices", "body": "A US federal judge has ruled that Alphabet Inc.'s Google must lift restrictions on rival marketplaces and billing systems, potentially denting its revenue by up to $1.5 billion in gross profit, as the company's dominance in the Android app market is challenged. The ruling, which takes effect on November 1, bars Google from paying developers exclusively to use its app store and forces the company to allow rival app stores to access its catalog, posing a significant threat to its revenue and market control.", "source": "https://finance.yahoo.com/news/google-play-must-allow-rival-185301327.html", "timestamp": "2024-10-08T00:19:45", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Market Trends", "Market Sentiment", "Earnings Report", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 873, "created_at": "2024-10-08T04:26:16.982063+00:00", "title": "Samsung Electronics warns of disappointing third-quarter profit due to delays in AI chip business and increased competition from Chinese rivals.", "body": "Samsung Electronics warned that its third-quarter profit would fall below market expectations, estimating an operating profit of 9.1 trillion won, down from 10.3 trillion won in the same period last year, due to delays in its AI chip business and increased competition from Chinese rivals. The company's semiconductor earnings declined, while its mobile division improved, and its contract chip manufacturing business is likely to continue losing money, contributing to a 1.6% drop in its share price.", "source": "https://finance.yahoo.com/news/samsung-electronics-estimates-274-jump-235615435.html", "timestamp": "2024-10-08T02:22:25", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 845, "created_at": "2024-10-06T04:23:24.393713+00:00", "title": "PVH and Peers in Apparel, Accessories, and Luxury Goods Sector Report Mixed Q2 Earnings Results", "body": "Among 17 apparel, accessories, and luxury goods stocks, revenues missed analysts' consensus estimates by 1.4%, with next quarter's revenue guidance 12.6% below expectations, despite a 2.9% average increase in share prices since latest earnings results. Notable performers include PVH, which reported revenues of $2.07 billion, down 6% year-over-year, and Kontoor Brands, which reported revenues of $606.9 million, down 1.5% year-over-year, but topped analysts' expectations and scored the highest full-year guidance raise among its peers.", "source": "https://finance.yahoo.com/news/apparel-accessories-luxury-goods-q2-094217092.html", "timestamp": "2024-10-04T09:42:00", "sector": "", "sub_sector": [], "tags": ["Earnings Report", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 885, "created_at": "2024-10-09T04:22:42.077978+00:00", "title": "Oil prices steady in Asian trading as traders weigh Middle East conflict against bearish demand expectations.", "body": "Oil prices steadied in Asian trading on Wednesday, with Brent crude futures rising 0.3% to $77.4 a barrel and US West Texas Intermediate futures rising to $73.71 a barrel, as traders weighed Middle East conflict developments against bearish demand expectations. Despite a 4% plunge in the previous session, markets remain wary of potential Israeli attacks on Iran's oil infrastructure, with weak demand and downgraded 2024 global oil demand growth forecasts capping oil market gains.", "source": "https://finance.yahoo.com/news/oil-prices-steady-sliding-potential-025507322.html", "timestamp": "2024-10-09T02:55:07", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Neutral"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 886, "created_at": "2024-10-09T04:23:04.213464+00:00", "title": "Chinese Equities Lead Losses in Asia as Weak Economic Data Dents Stimulus Hopes", "body": "The CSI 300 index plummeted 7.4%, its largest fall since 2020, as weak economic data and lack of commitment to further stimulus from Beijing led to investor concerns, erasing Tuesday's gains. The decline in Chinese equities also weighed on Asian shares, with Hong Kong stocks falling over 3%, and US equity futures slipping, as investors await more aggressive fiscal measures to stabilize growth expectations.", "source": "https://finance.yahoo.com/news/asian-stocks-rise-tech-lifts-223209246.html", "timestamp": "2024-10-09T02:27:14", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Interest Rates", "Market Trends", "Market Sentiment", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 887, "created_at": "2024-10-09T04:23:16.245913+00:00", "title": "Bank of America expects stocks to rise as companies report Q3 earnings, citing low bar set by Wall Street and optimism over lower interest rates.", "body": "Bank of America expects a low bar for Q3 earnings, with analysts predicting 2% earnings growth, but notes that companies expressing optimism about lower interest rates will be rewarded, leading to a potential stock market rally. With the Federal Reserve's interest rate cut, rate-sensitive sectors like manufacturing and housing are expected to rebound, driving earnings growth and a market rally that will broaden out into next year.", "source": "https://finance.yahoo.com/news/bar-earnings-low-stocks-rise-021146902.html", "timestamp": "2024-10-09T02:11:46", "sector": "financials", "sub_sector": ["banks"], "tags": ["Earnings Report", "Interest Rates", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 888, "created_at": "2024-10-09T04:23:32.394386+00:00", "title": "Meta Platforms plans to leverage AI to fuel growth in advertising revenue.", "body": "Meta Platforms reported strong Q2 earnings, beating Wall Street's projections with $5.16 per share and $39.07 billion in revenue, driven by a 21.6% increase in ad revenue, and provided an optimistic forecast for Q3 with projected revenue of $38.5-41 billion. The company's AI-powered advertising tools have seen significant adoption, with over 1 million advertisers using its generative AI ad tools, resulting in a 7.6% improvement in conversion rates, and analysts have raised their price targets, citing Meta's strong growth and leadership in digital advertising.", "source": "https://finance.yahoo.com/news/analyst-reset-meta-stock-price-010300563.html", "timestamp": "2024-10-09T01:03:00", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Earnings Report", "Artificial Intelligence", "Market Trends", "Market Sentiment", "Bullish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 1, "valuation": 1, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 889, "created_at": "2024-10-09T04:23:47.923573+00:00", "title": "Wall Street Braces for Earnings Season Amid Rising Uncertainties and High Expectations", "body": "Wall Street expects earnings to grow 4.7% in the third quarter, marking the fifth straight quarter of growth, but also the slowest year-over-year growth since Q4 2023. Despite this, strategists are wary of a muted market reaction due to high stock prices, looming election uncertainty, and rising tensions in the Middle East, which may overshadow earnings reports.", "source": "https://finance.yahoo.com/news/why-this-earnings-season-will-drive-a-muted-market-reaction-145018116.html", "timestamp": "2024-10-08T14:50:18", "sector": "financials", "sub_sector": ["holding-investment-companies"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "Market Analysis", "Bearish"], "tickers": [], "dimension": {"future": 1, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": null}, {"id": 890, "created_at": "2024-10-09T04:24:01.977813+00:00", "title": "Robotaxi Passengers Show High Satisfaction and Confidence in Autonomous Vehicles", "body": "A new study by J.D. Power found that robotaxi passengers rated their experience 8.53 out of 10, with \"vehicle technology\" being the leading contributor, and consumer confidence in robotaxis was 56% higher among those who have ridden one. Tesla's robotaxi ambitions, which could be a $5 trillion market according to Elon Musk, could be validated, with analysts at RBC Capital estimating a $1.7 trillion global market by 2040 with higher margins than the typical 5-10% seen in the automotive sector.", "source": "https://finance.yahoo.com/news/trust-in-robotaxis-is-higher-among-users-jd-power-study-finds-193350461.html", "timestamp": "2024-10-08T19:39:13", "sector": "technology", "sub_sector": ["technology-hardware-equipment"], "tags": ["Artificial Intelligence", "Bullish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 2, "valuation": 1, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 891, "created_at": "2024-10-09T04:24:13.38762+00:00", "title": "UN Report Reveals Criminal Syndicates in Southeast Asia Are Increasingly Using Digital Assets and AI to Carry Out Sophisticated Crimes", "body": "Criminal syndicates in Southeast Asia have lost $37 billion in 2023 through fraudulent activities, including money laundering, online scams, and underground banking, with 70% of crypto scams involving Tether stablecoin. The UN Office on Drugs and Crime recommends strengthening crypto regulations, including making it a crime for unlicensed virtual asset service providers to operate, to combat the growing threat of cyber-enabled fraud in the region.", "source": "https://finance.yahoo.com/news/criminal-syndicates-asia-harnessing-crypto-234441270.html", "timestamp": "2024-10-08T23:44:41", "sector": "financials", "sub_sector": ["financing-service"], "tags": ["Fintech", "Blockchain", "Economic Reports", "Bearish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": null}, {"id": 884, "created_at": "2024-10-09T04:22:31.366652+00:00", "title": "Oil prices steady after sharp decline amid concerns over China's economy and Middle East tensions.", "body": "Oil prices steadied near $77 a barrel after a 4.6% drop on Tuesday, as concerns about China's economic outlook and potential Middle East hostilities weighed on the market, with Brent price forecast raised to $80 a barrel by Morgan Stanley due to heightened geopolitical risk. Despite bearish headwinds from a weak Chinese economy and planned OPEC+ supply increase, oil demand remains weaker than expected, with US crude stockpiles expanding 11 million barrels last week.", "source": "https://finance.yahoo.com/news/oil-holds-china-induced-slump-233907513.html", "timestamp": "2024-10-09T02:55:21", "sector": "energy", "sub_sector": ["oil-gas-coal"], "tags": ["Energy Commodities", "Market Trends", "Market Sentiment", "Bearish"], "tickers": [], "dimension": {"future": 2, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 0, "financials": 1, "management": 0, "sustainability": 0}, "votes": [668]}, {"id": 869, "created_at": "2024-10-08T04:25:02.542762+00:00", "title": "Household Products Stocks Show Resilience in Q2 Earnings Season", "body": " Household products stocks, including Reynolds, Spectrum Brands, Kimberly-Clark, Church & Dwight, and Clorox, reported satisfactory Q2 earnings, with revenues beating analysts' consensus estimates by 1% and next quarter's revenue guidance 0.5% above expectations. Despite some misses, the group's share prices have been resilient, with an average increase of 5% since the latest earnings results, and individual stocks like Spectrum Brands and Clorox seeing significant gains of 13.1% and 20.3%, respectively.", "source": "https://finance.yahoo.com/news/q2-earnings-outperformers-reynolds-nasdaq-081858718.html", "timestamp": "2024-10-07T08:18:58", "sector": "consumer-non-cyclicals", "sub_sector": ["nondurable-household-products"], "tags": ["Earnings Report", "Market Trends", "Market Sentiment", "IDX", "Bullish"], "tickers": [], "dimension": {"future": 0, "dividend": 0, "ownership": 0, "technical": 0, "valuation": 2, "financials": 2, "management": 0, "sustainability": 0}, "votes": []}]